wiki/Mac-wiki.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://pengpengxp.github.io/css/wiki.css" />
#+TITLE: Mac wiki

* MSIC
** 不能识别家里的wifi信号
   是信道的原因，按照网上的教程，设置信道为1~11之间都行。

** DONE .bashrc
   在mac中不用.bashrc。而是使用.bash_profile

** 直接从terminal中启动emacs
  系统默认安装了emacs22,我下载了一个emacs24,安装好后就在`/Applications/Emacs.app/Contents/MacOS'下有Emacs可执行程序，在`.bash_profile'中加入一个alia要
就行了：
#+BEGIN_EXAMPLE
  alias em='/Applications/Emacs.app/Contents/MacOS/Emacs'
#+END_EXAMPLE
** DONE [#A] gpg
     去官网上下载来安装好了。
** DONE mac下unzip，gunzip在终端下都没有用
   使用port重新安装了一下unzip就能使用了。
** DONE [#A] texlive/latex				 :latex:texlive:font:
   已经安装完毕，就是字体没有设置好，还不能支持中文pdf。

   只要设置好中文字体，使用xelatex编译就行了。如下所示：
   #+BEGIN_EXAMPLE
     \documentclass[utf8]{amsart}
     \usepackage{xeCJK}
     \setCJKmainfont[BoldFont = Hiragino Sans GB W6]{Hiragino Sans GB W3}

     \begin{document}
     我爱中国
     \end{document}
   #+END_EXAMPLE
*** fontconfig
    用来配置字体文件的程序。mac上默认没有安装。可以使用brew来安装。这个安装上以后就可以使用fc-list来查询mac上可以使用的字体了。
*** mac上安装新字体
    如果是单个字体，直接用鼠标双击就行了。可以使用mac中自代的字体册程序来卸载。
**** TODO 可以使用类似于mkfontscale,mkfontdir,fc-cache这样的程序来安装多个字体吗？
