wiki/Mac-wiki.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-25 一 17:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mac wiki</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pengpengxp" />
<link rel="stylesheet" type="text/css" href="https://pengpengxp.github.io/css/wiki.css" />
</head>
<body>
<div id="content">
<h1 class="title">Mac wiki</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga2499aa">1. MSIC</a>
<ul>
<li><a href="#org2affac1">1.1. 不能识别家里的wifi信号</a></li>
<li><a href="#org4a218f4">1.2. <span class="done DONE">DONE</span> .bashrc</a></li>
<li><a href="#org1a7f406">1.3. 直接从terminal中启动emacs</a></li>
<li><a href="#org797a7ac">1.4. <span class="done DONE">DONE</span> gpg</a></li>
<li><a href="#org3252e42">1.5. <span class="done DONE">DONE</span> mac下unzip，gunzip在终端下都没有用</a></li>
<li><a href="#org20f3100">1.6. <span class="done DONE">DONE</span> texlive/latex&#xa0;&#xa0;&#xa0;<span class="tag"><span class="latex">latex</span>&#xa0;<span class="texlive">texlive</span>&#xa0;<span class="font">font</span></span></a>
<ul>
<li><a href="#org8e72185">1.6.1. fontconfig</a></li>
<li><a href="#org63fc9f3">1.6.2. mac上安装新字体</a></li>
<li><a href="#orge1918f1">1.6.3. 网上找到的为整个系统设置字体</a></li>
<li><a href="#org2ff2d06">1.6.4. 为某个文章单独设置字体&#xa0;&#xa0;&#xa0;<span class="tag"><span class="__">有用</span></span></a></li>
</ul>
</li>
<li><a href="#orgad5399e">1.7. <span class="done DONE">DONE</span> F1这些就是F1</a></li>
<li><a href="#org231d99e">1.8. <span class="done DONE">DONE</span> find不能像使用linux那样</a></li>
<li><a href="#org2b315ed">1.9. <span class="done DONE">DONE</span> finder不能使用键盘打开文件</a></li>
<li><a href="#orgde0b94f">1.10. iterm2中的修改按键</a></li>
<li><a href="#orga4c452f">1.11. 安装go2shell</a></li>
<li><a href="#org1d8de93">1.12. mac下的包管理器&#xa0;&#xa0;&#xa0;<span class="tag"><span class="homebrew">homebrew</span>&#xa0;<span class="macports">macports</span></span></a>
<ul>
<li><a href="#org656a713">1.12.1. homebrew</a></li>
<li><a href="#orga1f5719">1.12.2. <span class="done DONE">DONE</span> macports没有安装好，估计是墙的问题</a></li>
</ul>
</li>
<li><a href="#org203810d">1.13. 自动跳转的工具</a>
<ul>
<li><a href="#org1aade3e">1.13.1. autojump</a></li>
<li><a href="#org4a9a957">1.13.2. fasd</a></li>
<li><a href="#org9a0bc8c">1.13.3. z</a></li>
</ul>
</li>
<li><a href="#org8d5c0e8">1.14. 创建智能文件夹&#xa0;&#xa0;&#xa0;<span class="tag"><span class="finder">finder</span></span></a></li>
<li><a href="#orgec5f37f">1.15. <span class="done DONE">DONE</span> 免费的Finder增强工具：XtraFinder&#xa0;&#xa0;&#xa0;<span class="tag"><span class="xtrafinder">xtrafinder</span></span></a></li>
<li><a href="#org9dac94d">1.16. pmset</a></li>
<li><a href="#org1ded5ba">1.17. <span class="done DONE">DONE</span> 输入法问题</a></li>
<li><a href="#org7d7cffc">1.18. Caffene</a></li>
<li><a href="#org5f5dc13">1.19. yesomite下U盘的默认的挂载目录</a></li>
<li><a href="#org4ec75fb">1.20. <span class="done DONE">DONE</span> 一些gnu套件</a></li>
<li><a href="#org5e0b55f">1.21. <span class="done DONE">DONE</span> 挂载的U盘不在/dev/sd*</a></li>
<li><a href="#org5219047">1.22. linux中的mkfs可以使用newfs<sub>*</sub>来替代</a></li>
<li><a href="#org20e29bd">1.23. 使用reeder来查看rss</a></li>
<li><a href="#org353bde8">1.24. 识别小米手机</a>
<ul>
<li><a href="#org35465e8">1.24.1. <span class="todo TODO">TODO</span> 可以试试其它android设备</a></li>
<li><a href="#org6a3c866">1.24.2. <span class="todo TODO">TODO</span> android-adb for mac</a></li>
</ul>
</li>
<li><a href="#org67e6942">1.25. 开机就需要启动的程序&#xa0;&#xa0;&#xa0;<span class="tag"><span class="____">开机启动</span></span></a></li>
<li><a href="#orgc1a3b34">1.26. gcc&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gcc">gcc</span></span></a></li>
<li><a href="#org965211c">1.27. <span class="done DONE">DONE</span> 虚拟机&#xa0;&#xa0;&#xa0;<span class="tag"><span class="virtual">virtual</span></span></a></li>
<li><a href="#org3cb538f">1.28. 挂载虚拟光驱</a></li>
<li><a href="#org1235b47">1.29. dia在yesomite中闪退，capitan中也启动不起来</a></li>
<li><a href="#org66c3ae5">1.30. 安装和使用gnuplot</a></li>
<li><a href="#orge8bf7a5">1.31. <span class="done DONE">DONE</span> 没有使用默认的邮箱</a></li>
<li><a href="#orge4bbe87">1.32. <span class="done DONE">DONE</span> dmg文件安装完成后在桌面上还有残留</a></li>
<li><a href="#org7269598">1.33. 在mac中修改按键设定&#xa0;&#xa0;&#xa0;<span class="tag"><span class="change_key">change_key</span>&#xa0;<span class="karabiner">karabiner</span></span></a>
<ul>
<li><a href="#org08eac56">1.33.1. Karabiner</a></li>
<li><a href="#org9b6abbf">1.33.2. seil</a></li>
<li><a href="#org1d036f6">1.33.3. 使用CapsLock一个按键打开alfred</a></li>
<li><a href="#orga3fe67e">1.33.4. 通过karabiner使用我的filco键盘</a></li>
</ul>
</li>
<li><a href="#org61abe7b">1.34. <span class="done DONE">DONE</span> 控制mac的剪切板</a></li>
<li><a href="#org7182181">1.35. 使用鼠标&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mouse">mouse</span>&#xa0;<span class="__">鼠标</span>&#xa0;<span class="reverse">reverse</span>&#xa0;<span class="scrolling">scrolling</span></span></a></li>
<li><a href="#org5796408">1.36. 截图&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jietu">jietu</span>&#xa0;<span class="capture_picture">capture_picture</span></span></a></li>
<li><a href="#org3f1f8fc">1.37. hyperswitch</a></li>
<li><a href="#org18a7143">1.38. 突然不能打开 网络设置 的面板</a></li>
<li><a href="#org790ac96">1.39. 窗口管理&#xa0;&#xa0;&#xa0;<span class="tag"><span class="manage">manage</span>&#xa0;<span class="windows">windows</span>&#xa0;<span class="maxmize">maxmize</span></span></a>
<ul>
<li><a href="#orgafd5636">1.39.1. 最大化窗口</a></li>
<li><a href="#org18913c5">1.39.2. 使用了slate来管理窗口&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slate">slate</span></span></a></li>
<li><a href="#orge95d4f1">1.39.3. <span class="todo TODO">TODO</span> moom 该软件还没有使用过</a></li>
</ul>
</li>
<li><a href="#org8508486">1.40. 禁止了cnnic证书</a></li>
<li><a href="#org2708414">1.41. 从源码编译emacs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
<li><a href="#org6eccca0">1.42. mac中的gdb</a></li>
<li><a href="#orgba7ff34">1.43. 在mac中使用swift编程&#xa0;&#xa0;&#xa0;<span class="tag"><span class="swift">swift</span></span></a></li>
<li><a href="#org5757450">1.44. <span class="done DONE">DONE</span> 对ntfs的磁盘只读</a></li>
<li><a href="#org9ebcfb5">1.45. macbook合住盖子而不进入待机</a></li>
<li><a href="#orga4b905f">1.46. 录制Gif图片</a></li>
<li><a href="#orgdb7dc0f">1.47. cdto</a></li>
<li><a href="#org0696603">1.48. just focus 番茄工作法加定时锁屏，常用软件</a></li>
<li><a href="#org4def101">1.49. <span class="todo TODO">TODO</span> 待办</a>
<ul>
<li><a href="#org9bf74fe">1.49.1. <span class="todo TODO">TODO</span> 从源码安装了wget后，从bash中启动emacs可以找到，但是从launchpad中启动还是提示找不到wget</a></li>
<li><a href="#org8846c8f">1.49.2. <span class="todo TODO">TODO</span> 查字典</a></li>
<li><a href="#org5af00b3">1.49.3. <span class="todo TODO">TODO</span> 通过zip安装的软件</a></li>
<li><a href="#org6675c6c">1.49.4. <span class="todo TODO">TODO</span> 不断网锁屏</a></li>
<li><a href="#orgbf52a87">1.49.5. <span class="todo TODO">TODO</span> 连接各种外设</a></li>
<li><a href="#org257d99a">1.49.6. <span class="todo TODO">TODO</span> microsoft-office使用brew没有下载下来。不行不装了。就用iwork。</a></li>
<li><a href="#orgc2740e1">1.49.7. <span class="todo TODO">TODO</span> 禁用触摸板</a></li>
<li><a href="#orgf3862ab">1.49.8. <span class="todo TODO">TODO</span> 把下载中的内容归类。软件这些都保存起来。</a></li>
<li><a href="#org9c0470e">1.49.9. <span class="todo TODO">TODO</span> finder中使用`/'来进入某一文件夹</a></li>
<li><a href="#org26000ee">1.49.10. <span class="todo TODO">TODO</span> mou可以用来写markdown</a></li>
<li><a href="#orgef087c5">1.49.11. <span class="todo TODO">TODO</span> jitouch功能更强大的多点触控软件</a></li>
<li><a href="#orgcb99f3f">1.49.12. <span class="todo TODO">TODO</span> 不像linux一样可以使用fdisk直接对U盘这些进行分区</a></li>
<li><a href="#org93ccbb7">1.49.13. <span class="todo TODO">TODO</span> 文档查看器</a></li>
<li><a href="#org0b293cd">1.49.14. <span class="todo TODO">TODO</span> mount和route命令和linux上不同</a></li>
<li><a href="#org5b8b23f">1.49.15. <span class="todo TODO">TODO</span> clamAV for mac</a></li>
<li><a href="#org0386b9e">1.49.16. <span class="todo TODO">TODO</span> jabref</a></li>
<li><a href="#org84d817a">1.49.17. <span class="todo TODO">TODO</span> wireshark</a></li>
<li><a href="#org44ea9d1">1.49.18. <span class="todo TODO">TODO</span> 不从terminal启动emacs，则一些环境变量没有设置正确</a></li>
</ul>
</li>
<li><a href="#org402d0c3">1.50. calibre管理书籍</a></li>
</ul>
</li>
<li><a href="#orgc6af8f7">2. apple-script学习笔记</a></li>
<li><a href="#org6393e1a">3. 键盘效率工具</a>
<ul>
<li><a href="#org3e06294">3.1. splotlight</a></li>
<li><a href="#org65d7b1d">3.2. alfred</a>
<ul>
<li><a href="#org089828b">3.2.1. Quicksilver</a></li>
</ul>
</li>
<li><a href="#org2c80d4a">3.3. 资料</a></li>
<li><a href="#org5b95c1b">3.4. 我的配置过程</a></li>
<li><a href="#orgd4f7471">3.5. karabiner配置</a></li>
<li><a href="#org02dd53a">3.6. slate 中文指导</a></li>
<li><a href="#org8bdbadb">3.7. catchMouse可以用来在多显示器是切换鼠标焦点</a></li>
<li><a href="#org18592d8">3.8. Spectacle可以实现slate大部分的功能。 <b>最重要的是：它可以把一个windows从一个显示器通过快捷键发送到另一个里面</b></a></li>
<li><a href="#org4d00d21">3.9. shortcat 可以使用快捷键来选择</a></li>
</ul>
</li>
<li><a href="#org1db45ac">4. 和原生Terminal打交道</a></li>
<li><a href="#org7561262">5. open</a></li>
<li><a href="#org38a2e65">6. workspace</a>
<ul>
<li><a href="#org08ab282">6.1. 试试xmonad</a></li>
</ul>
</li>
<li><a href="#orgc532b13">7. 多个远程终端登陆的配置</a></li>
<li><a href="#org4c50399">8. archmage</a></li>
<li><a href="#org743aa13">9. 修改键盘的速率</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga2499aa" class="outline-2">
<h2 id="orga2499aa"><span class="section-number-2">1</span> MSIC</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2affac1" class="outline-3">
<h3 id="org2affac1"><span class="section-number-3">1.1</span> 不能识别家里的wifi信号</h3>
<div class="outline-text-3" id="text-1-1">
<p>
是信道的原因，按照网上的教程，设置信道为1~11之间都行。
</p>
</div>
</div>

<div id="outline-container-org4a218f4" class="outline-3">
<h3 id="org4a218f4"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> .bashrc</h3>
<div class="outline-text-3" id="text-1-2">
<p>
在mac中不用.bashrc。而是使用.bash<sub>profile</sub>
</p>
</div>
</div>

<div id="outline-container-org1a7f406" class="outline-3">
<h3 id="org1a7f406"><span class="section-number-3">1.3</span> 直接从terminal中启动emacs</h3>
<div class="outline-text-3" id="text-1-3">
<p>
  系统默认安装了emacs22,我下载了一个emacs24,安装好后就在`/Applications/Emacs.app/Contents/MacOS'下有Emacs可执行程序，在`.bash<sub>profile</sub>'中加入一个alia要
就行了：
</p>
<pre class="example">
  alias em='/Applications/Emacs.app/Contents/MacOS/Emacs'
</pre>
</div>
</div>
<div id="outline-container-org797a7ac" class="outline-3">
<h3 id="org797a7ac"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> gpg</h3>
<div class="outline-text-3" id="text-1-4">
<p>
去官网上下载来安装好了。
</p>
</div>
</div>
<div id="outline-container-org3252e42" class="outline-3">
<h3 id="org3252e42"><span class="section-number-3">1.5</span> <span class="done DONE">DONE</span> mac下unzip，gunzip在终端下都没有用</h3>
<div class="outline-text-3" id="text-1-5">
<p>
使用port重新安装了一下unzip就能使用了。
</p>
</div>
</div>
<div id="outline-container-org20f3100" class="outline-3">
<h3 id="org20f3100"><span class="section-number-3">1.6</span> <span class="done DONE">DONE</span> texlive/latex&#xa0;&#xa0;&#xa0;<span class="tag"><span class="latex">latex</span>&#xa0;<span class="texlive">texlive</span>&#xa0;<span class="font">font</span></span></h3>
<div class="outline-text-3" id="text-1-6">
<p>
已经安装完毕，就是字体没有设置好，还不能支持中文pdf。
</p>

<p>
只要设置好中文字体，使用xelatex编译就行了。如下所示：
</p>
<pre class="example">
     \documentclass[utf8]{amsart}
     \usepackage{xeCJK}
     \setCJKmainfont[BoldFont = Hiragino Sans GB W6]{Hiragino Sans GB W3}

     \begin{document}
     我爱中国
     \end{document}
</pre>
</div>
<div id="outline-container-org8e72185" class="outline-4">
<h4 id="org8e72185"><span class="section-number-4">1.6.1</span> fontconfig</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
用来配置字体文件的程序。mac上默认没有安装。可以使用brew来安装。这个安装上以后就可以使用fc-list来查询mac上可以使用的字体了。
</p>
</div>
</div>
<div id="outline-container-org63fc9f3" class="outline-4">
<h4 id="org63fc9f3"><span class="section-number-4">1.6.2</span> mac上安装新字体</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
如果是单个字体，直接用鼠标双击就行了。可以使用mac中自代的字体册程序来卸载。
</p>
</div>
<ol class="org-ol">
<li><a id="org3a033fe"></a><span class="todo TODO">TODO</span> 可以使用类似于mkfontscale,mkfontdir,fc-cache这样的程序来安装多个字体吗？<br /></li>
</ol>
</div>
