wiki/Mac-wiki.org
*** 网上找到的为整个系统设置字体
    和texlive差不多，实际上就是修改`/usr/local/texlive/2014/texmf-dist/tex/latex/ctex/fontset/ctex-xecjk-winfonts.def'这个文件。

    参考了一下这里：
    #+BEGIN_EXAMPLE
      Reload Original PagePrint PageEmail Page
      MacTex 2010 XeLatex中文支持

      【2011年8月12日更新】

      在Mac OS X 上安装MacTex后，需要修改文件 /usr/local/texlive/2009/texmf-dist/tex/latex/ctex/fontset/ctex-xecjk-winfonts.def 中的字体设置，

      才能使用XeLatex来编译中文文件。该文件的内容为：

      % ctex-xecjk-winfonts.def: Windows 的 xeCJK 字体设置，默认为六种中易字体

      % vim:ft=tex

      \setCJKmainfont[BoldFont={SimHei},ItalicFont={[simkai.ttf]}]{SimSun}

      \setCJKsansfont{SimHei}

      \setCJKmonofont{[simfang.ttf]}

      \setCJKfamilyfont{zhsong}{SimSun}

      \setCJKfamilyfont{zhhei}{SimHei}

      \setCJKfamilyfont{zhkai}{[simkai.ttf]}

      \setCJKfamilyfont{zhfs}{[simfang.ttf]}

      \newcommand*{\songti}{\CJKfamily{zhsong}} % 宋体

      \newcommand*{\heiti}{\CJKfamily{zhhei}}   % 黑体

      \newcommand*{\kaishu}{\CJKfamily{zhkai}}  % 楷书

      \newcommand*{\fangsong}{\CJKfamily{zhfs}} % 仿宋

      \newcommand*{\lishu}{\CJKfamily{zhli}}    % 隶书

      \newcommand*{\youyuan}{\CJKfamily{zhyou}} % 幼圆

      \endinput

      直接运行XeLatex编译中文文档，会出现如下错误：

      ! fontspec error: "font-not-found"

      !

      ! The font "[SIMKAI.TTF]" cannot be found.

      !

      即字体"[SIMKAI.TTF]"无法找到。

      利用fc-list命令，可以查到系统中已经安装的楷体字体的名称，即在终端执行：

	  sudo fc-list :lang=zh-cn

      可以查到与楷体对应的行为：

	  楷体_GB2312,KaiTi_GB2312:style=Regular

      也就是说，系统中楷体字的名称为“KaiTi_GB2312”，因此需将"[SIMKAI.TTF]"改为“KaiTi_GB2312”，即将第一行改为

	  \setCJKmainfont[BoldFont={SimHei},ItalicFont={KaiTi_GB2312}]{SimSun}
    #+END_EXAMPLE
    字体改为自己需要的就行了。

    我自己下载了simsun,simhei这两个免费的字体。然后提示我找不到Simkai。

    这里参考 [[http://homepage.fudan.edu.cn/guqun/zh/2012/11/27/chinese-font-missing-problem-in-mactex-2012/][这里]] 说的就行了：
    #+BEGIN_EXAMPLE
      Chinese Font Missing Problem in MacTeX 2012 on Mac OS X 10.8
      Posted on 2012年11月27日 by Qun Gu

      If you install MacTeX and then use xelatex to compile a ctexart file,
      an error that font file SIMKAI.TTF is missing will pop up. Here is the
      cure for this problem.

      sudo vi /usr/local/texlive/2012/texmf-dist/tex/latex/ctex/fontset/ctex-xecjk-winfonts

      Then replace all [SIMKAI.TTF] into STKaiti.

      Be careful: It is possible to have TWO PLACES to be modified!

      If you want to use Fang Song font, change [SIMFANG] into STFangsong.

      Enjoy!

      Q.
    #+END_EXAMPLE

    这样就修改成了华文仿宋和华文楷体。

    修改后的`/usr/local/texlive/2014/texmf-dist/tex/latex/ctex/fontset/ctex-xecjk-winfonts.def'如下所示：
    #+BEGIN_EXAMPLE
      % ctex-xecjk-winfonts.def: Windows 的 xeCJK 字体设置，默认为六种中易字体

      % vim:ft=tex

      \setCJKmainfont[BoldFont={SimHei},ItalicFont={STKaiti}]{SimSun}

      \setCJKsansfont{SimHei}

      \setCJKmonofont{STFangsong}

      \setCJKfamilyfont{zhsong}{SimSun}

      \setCJKfamilyfont{zhhei}{SimHei}

      \setCJKfamilyfont{zhkai}{STKaiti}

      \setCJKfamilyfont{zhfs}{STFangsong}

      \newcommand*{\songti}{\CJKfamily{zhsong}} % 宋体

      \newcommand*{\heiti}{\CJKfamily{zhhei}}   % 黑体

      \newcommand*{\kaishu}{\CJKfamily{zhkai}}  % 楷书

      \newcommand*{\fangsong}{\CJKfamily{zhfs}} % 仿宋

      \newcommand*{\lishu}{\CJKfamily{zhli}}    % 隶书

      \newcommand*{\youyuan}{\CJKfamily{zhyou}} % 幼圆

      \endinput

    #+END_EXAMPLE
*** 为某个文章单独设置字体						 :有用:
    安装好texlive或者mactex这些套件后，可以不修改其配置文件。直接在每个tex文件中使用xeCJK显示的指定就行了。这样就可以不使用ctexart了。但是这样样式就完全需要自己来做，这是很不好的。不是很推荐。但是这样可以对latex如何处理中文字体有更好的理解。

    模版如下：
    #+BEGIN_LaTeX
      \documentclass{article}

      \usepackage{xeCJK}

      % 下面这些字体一定要是系统有的
      \setCJKmainfont[BoldFont={SimHei},ItalicFont={STKaiti}]{SimSun}
      \setCJKsansfont{SimHei}
      \setCJKmonofont{STFangsong}
      \setCJKfamilyfont{zhsong}{SimSun}
      \setCJKfamilyfont{zhhei}{SimHei}
      \setCJKfamilyfont{zhkai}{STKaiti}
      \setCJKfamilyfont{zhfs}{STFangsong}

      % 重新定义一些中文拼音命令方便使用
      \newcommand*{\songti}{\CJKfamily{zhsong}} % 宋体
      \newcommand*{\heiti}{\CJKfamily{zhhei}}   % 黑体
      \newcommand*{\kaishu}{\CJKfamily{zhkai}}  % 楷书
      \newcommand*{\fangsong}{\CJKfamily{zhfs}} % 仿宋
      \newcommand*{\lishu}{\CJKfamily{zhli}}    % 隶书
      \newcommand*{\youyuan}{\CJKfamily{zhyou}} % 幼圆

      \begin{document}
      你好，TeX Live 2009！

      \lishu{这是隶书}

      \fangsong{这是仿宋}

      \songti{这是宋体}

      \heiti{这是黑体}

      \kaishu{这是楷书}

      \youyuan{这是幼圆}
      \end{document}
    #+END_LaTeX
** DONE F1这些就是F1
   - State "DONE"       from "TODO"       [2015-02-15 日 22:27] \\
     可以直接在键盘中设置。
** DONE find不能像使用linux那样
   - State "DONE"       from "TODO"       [2015-02-16 一 08:56]
   应该是一样的。只是可能格式上要求更严格了一点。
** DONE finder不能使用键盘打开文件
   - State "DONE"       from "TODO"       [2015-02-15 日 22:22]
   C-o

** iterm2中的修改按键
   可以直接在preference中的keys中修改option和command的功能。我把left-command和right-option映射为control。

   但是没有alt功能。我在preference中的profiles的keys中把option映射为esc。然后把右command键映射为option。基本能用了。

   最后我把control设置成了command。
** 安装go2shell
   可以在finder中的任意位置打开终端。

   1、订阅者推荐：Go2Shell，我们通过Finder浏览文件的时候，常常需要在浏
   览的文件目录中打开终端进行操作，Go2Shell就能自动做到这一点。从App
   Store下载这个免费软件
   （https://itunes.apple.com/us/app/go2shell/id445770608?mt=12 ）。下载完
   成后从应用程序文件夹把Go2Shell拖到Finder工具栏上，然后随便进入一个目录，
   点击Go2Shell图标，即可打开终端进入该目录。  Go2Shell支持原生终端、
   iTerm2和xterm，比我之前用过的>cd to ...app方便。在终端输入open -a
   Go2Shell --args config即可进入配置界面，选择你喜欢的终端。

   测试了一下，Yosemite下面需要按往command键才能拖入。
** mac下的包管理器					  :homebrew:macports:
   主要有：homebrew,macports,fink。一般情况下优先使用homebrew。
*** homebrew
**** DONE [#A] install homebrew
     - State "DONE"       from "TODO"       [2015-02-13 五 15:14]
       #+BEGIN_EXAMPLE
       	 ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
       #+END_EXAMPLE

       在使用brew search <XXX>时，会很慢，我的方法是直接使用brew search|grep。

       brew doctor和brew update需要经常使用。一个是检查brew有没有出现错误。一个是对brew和通过brew安装的软件进行升级。

       还有一个brew-cask。用于套件的安装。如QQ，迅雷这些。
**** 使用中可能出现的问题
     可能出现下面的问题：
     #+BEGIN_EXAMPLE
       error: Your local changes to the following files would be overwritten by merge:
     #+END_EXAMPLE

     执行了下面几句话就行了：
     #+BEGIN_EXAMPLE
       cd `brew --prefix`
       git fetch origin
       git reset --hard origin/master
     #+END_EXAMPLE

     最后一句是使用sudo才成功的。

     据说就下面这样就行了：
     #+BEGIN_EXAMPLE
       cd `brew --prefix`; git reset --hard
     #+END_EXAMPLE

