wiki/Mac-wiki.html
<div id="outline-container-orge1918f1" class="outline-4">
<h4 id="orge1918f1"><span class="section-number-4">1.6.3</span> 网上找到的为整个系统设置字体</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
和texlive差不多，实际上就是修改`/usr/local/texlive/2014/texmf-dist/tex/latex/ctex/fontset/ctex-xecjk-winfonts.def'这个文件。
</p>

<p>
参考了一下这里：
</p>
<pre class="example">
      Reload Original PagePrint PageEmail Page
      MacTex 2010 XeLatex中文支持

      【2011年8月12日更新】

      在Mac OS X 上安装MacTex后，需要修改文件 /usr/local/texlive/2009/texmf-dist/tex/latex/ctex/fontset/ctex-xecjk-winfonts.def 中的字体设置，

      才能使用XeLatex来编译中文文件。该文件的内容为：

      % ctex-xecjk-winfonts.def: Windows 的 xeCJK 字体设置，默认为六种中易字体

      % vim:ft=tex

      \setCJKmainfont[BoldFont={SimHei},ItalicFont={[simkai.ttf]}]{SimSun}

      \setCJKsansfont{SimHei}

      \setCJKmonofont{[simfang.ttf]}

      \setCJKfamilyfont{zhsong}{SimSun}

      \setCJKfamilyfont{zhhei}{SimHei}

      \setCJKfamilyfont{zhkai}{[simkai.ttf]}

      \setCJKfamilyfont{zhfs}{[simfang.ttf]}

      \newcommand*{\songti}{\CJKfamily{zhsong}} % 宋体

      \newcommand*{\heiti}{\CJKfamily{zhhei}}   % 黑体

      \newcommand*{\kaishu}{\CJKfamily{zhkai}}  % 楷书

      \newcommand*{\fangsong}{\CJKfamily{zhfs}} % 仿宋

      \newcommand*{\lishu}{\CJKfamily{zhli}}    % 隶书

      \newcommand*{\youyuan}{\CJKfamily{zhyou}} % 幼圆

      \endinput

      直接运行XeLatex编译中文文档，会出现如下错误：

      ! fontspec error: "font-not-found"

      !

      ! The font "[SIMKAI.TTF]" cannot be found.

      !

      即字体"[SIMKAI.TTF]"无法找到。

      利用fc-list命令，可以查到系统中已经安装的楷体字体的名称，即在终端执行：

	  sudo fc-list :lang=zh-cn

      可以查到与楷体对应的行为：

	  楷体_GB2312,KaiTi_GB2312:style=Regular

      也就是说，系统中楷体字的名称为“KaiTi_GB2312”，因此需将"[SIMKAI.TTF]"改为“KaiTi_GB2312”，即将第一行改为

	  \setCJKmainfont[BoldFont={SimHei},ItalicFont={KaiTi_GB2312}]{SimSun}
</pre>
<p>
字体改为自己需要的就行了。
</p>

<p>
我自己下载了simsun,simhei这两个免费的字体。然后提示我找不到Simkai。
</p>

<p>
这里参考 <a href="http://homepage.fudan.edu.cn/guqun/zh/2012/11/27/chinese-font-missing-problem-in-mactex-2012/">这里</a> 说的就行了：
</p>
<pre class="example">
      Chinese Font Missing Problem in MacTeX 2012 on Mac OS X 10.8
      Posted on 2012年11月27日 by Qun Gu

      If you install MacTeX and then use xelatex to compile a ctexart file,
      an error that font file SIMKAI.TTF is missing will pop up. Here is the
      cure for this problem.

      sudo vi /usr/local/texlive/2012/texmf-dist/tex/latex/ctex/fontset/ctex-xecjk-winfonts

      Then replace all [SIMKAI.TTF] into STKaiti.

      Be careful: It is possible to have TWO PLACES to be modified!

      If you want to use Fang Song font, change [SIMFANG] into STFangsong.

      Enjoy!

      Q.
</pre>

<p>
这样就修改成了华文仿宋和华文楷体。
</p>

<p>
修改后的`/usr/local/texlive/2014/texmf-dist/tex/latex/ctex/fontset/ctex-xecjk-winfonts.def'如下所示：
</p>
<pre class="example">
      % ctex-xecjk-winfonts.def: Windows 的 xeCJK 字体设置，默认为六种中易字体

      % vim:ft=tex

      \setCJKmainfont[BoldFont={SimHei},ItalicFont={STKaiti}]{SimSun}

      \setCJKsansfont{SimHei}

      \setCJKmonofont{STFangsong}

      \setCJKfamilyfont{zhsong}{SimSun}

      \setCJKfamilyfont{zhhei}{SimHei}

      \setCJKfamilyfont{zhkai}{STKaiti}

      \setCJKfamilyfont{zhfs}{STFangsong}

      \newcommand*{\songti}{\CJKfamily{zhsong}} % 宋体

      \newcommand*{\heiti}{\CJKfamily{zhhei}}   % 黑体

      \newcommand*{\kaishu}{\CJKfamily{zhkai}}  % 楷书

      \newcommand*{\fangsong}{\CJKfamily{zhfs}} % 仿宋

      \newcommand*{\lishu}{\CJKfamily{zhli}}    % 隶书

      \newcommand*{\youyuan}{\CJKfamily{zhyou}} % 幼圆

      \endinput

</pre>
</div>
</div>
<div id="outline-container-org2ff2d06" class="outline-4">
<h4 id="org2ff2d06"><span class="section-number-4">1.6.4</span> 为某个文章单独设置字体&#xa0;&#xa0;&#xa0;<span class="tag"><span class="__">有用</span></span></h4>
<div class="outline-text-4" id="text-1-6-4">
<p>
安装好texlive或者mactex这些套件后，可以不修改其配置文件。直接在每个tex文件中使用xeCJK显示的指定就行了。这样就可以不使用ctexart了。但是这样样式就完全需要自己来做，这是很不好的。不是很推荐。但是这样可以对latex如何处理中文字体有更好的理解。
</p>

<p>
模版如下：
</p>
<div class="LaTeX">
<p>
\documentclass{article}
</p>

<p>
\usepackage{xeCJK}
</p>

<p>
% 下面这些字体一定要是系统有的
\setCJKmainfont[BoldFont={SimHei},ItalicFont={STKaiti}]{SimSun}
\setCJKsansfont{SimHei}
\setCJKmonofont{STFangsong}
\setCJKfamilyfont{zhsong}{SimSun}
\setCJKfamilyfont{zhhei}{SimHei}
\setCJKfamilyfont{zhkai}{STKaiti}
\setCJKfamilyfont{zhfs}{STFangsong}
</p>

<p>
% 重新定义一些中文拼音命令方便使用
\newcommand*{\songti}{\CJKfamily{zhsong}} % 宋体
\newcommand*{\heiti}{\CJKfamily{zhhei}}   % 黑体
\newcommand*{\kaishu}{\CJKfamily{zhkai}}  % 楷书
\newcommand*{\fangsong}{\CJKfamily{zhfs}} % 仿宋
\newcommand*{\lishu}{\CJKfamily{zhli}}    % 隶书
\newcommand*{\youyuan}{\CJKfamily{zhyou}} % 幼圆
</p>

\begin{document}
你好，TeX Live 2009！

\lishu{这是隶书}

\fangsong{这是仿宋}

\songti{这是宋体}

\heiti{这是黑体}

\kaishu{这是楷书}

\youyuan{这是幼圆}
\end{document}

</div>
</div>
</div>
</div>
<div id="outline-container-orgad5399e" class="outline-3">
<h3 id="orgad5399e"><span class="section-number-3">1.7</span> <span class="done DONE">DONE</span> F1这些就是F1</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-15 日 22:27] </span></span> <br />
可以直接在键盘中设置。</li>
</ul>
</div>
</div>
<div id="outline-container-org231d99e" class="outline-3">
<h3 id="org231d99e"><span class="section-number-3">1.8</span> <span class="done DONE">DONE</span> find不能像使用linux那样</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-16 一 08:56]</span></span></li>
</ul>
<p>
应该是一样的。只是可能格式上要求更严格了一点。
</p>
</div>
</div>
<div id="outline-container-org2b315ed" class="outline-3">
<h3 id="org2b315ed"><span class="section-number-3">1.9</span> <span class="done DONE">DONE</span> finder不能使用键盘打开文件</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-15 日 22:22]</span></span></li>
</ul>
<p>
C-o
</p>
</div>
</div>

<div id="outline-container-orgde0b94f" class="outline-3">
<h3 id="orgde0b94f"><span class="section-number-3">1.10</span> iterm2中的修改按键</h3>
<div class="outline-text-3" id="text-1-10">
<p>
可以直接在preference中的keys中修改option和command的功能。我把left-command和right-option映射为control。
</p>

<p>
但是没有alt功能。我在preference中的profiles的keys中把option映射为esc。然后把右command键映射为option。基本能用了。
</p>

<p>
最后我把control设置成了command。
</p>
</div>
</div>
<div id="outline-container-orga4c452f" class="outline-3">
<h3 id="orga4c452f"><span class="section-number-3">1.11</span> 安装go2shell</h3>
<div class="outline-text-3" id="text-1-11">
<p>
可以在finder中的任意位置打开终端。
</p>

<p>
1、订阅者推荐：Go2Shell，我们通过Finder浏览文件的时候，常常需要在浏
览的文件目录中打开终端进行操作，Go2Shell就能自动做到这一点。从App
Store下载这个免费软件
（<a href="https://itunes.apple.com/us/app/go2shell/id445770608?mt=12">https://itunes.apple.com/us/app/go2shell/id445770608?mt=12</a> ）。下载完
成后从应用程序文件夹把Go2Shell拖到Finder工具栏上，然后随便进入一个目录，
点击Go2Shell图标，即可打开终端进入该目录。  Go2Shell支持原生终端、
iTerm2和xterm，比我之前用过的&gt;cd to &#x2026;app方便。在终端输入open -a
Go2Shell &#x2013;args config即可进入配置界面，选择你喜欢的终端。
</p>

<p>
测试了一下，Yosemite下面需要按往command键才能拖入。
</p>
</div>
</div>
<div id="outline-container-org1d8de93" class="outline-3">
<h3 id="org1d8de93"><span class="section-number-3">1.12</span> mac下的包管理器&#xa0;&#xa0;&#xa0;<span class="tag"><span class="homebrew">homebrew</span>&#xa0;<span class="macports">macports</span></span></h3>
<div class="outline-text-3" id="text-1-12">
<p>
主要有：homebrew,macports,fink。一般情况下优先使用homebrew。
</p>
</div>
<div id="outline-container-org656a713" class="outline-4">
<h4 id="org656a713"><span class="section-number-4">1.12.1</span> homebrew</h4>
<div class="outline-text-4" id="text-1-12-1">
</div>
<ol class="org-ol">
<li><a id="org058cbb2"></a><span class="done DONE">DONE</span> install homebrew<br />
<div class="outline-text-5" id="text-1-12-1-1">
<ul class="org-ul">
<li><p>
State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-13 五 15:14]</span></span>
</p>
<pre class="example">
       	 ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
</pre>

<p>
在使用brew search &lt;XXX&gt;时，会很慢，我的方法是直接使用brew search|grep。
</p>

<p>
brew doctor和brew update需要经常使用。一个是检查brew有没有出现错误。一个是对brew和通过brew安装的软件进行升级。
</p>

<p>
还有一个brew-cask。用于套件的安装。如QQ，迅雷这些。
</p></li>
</ul>
</div>
</li>
<li><a id="org99e914c"></a>使用中可能出现的问题<br />
<div class="outline-text-5" id="text-1-12-1-2">
<p>
可能出现下面的问题：
</p>
<pre class="example">
       error: Your local changes to the following files would be overwritten by merge:
</pre>

<p>
执行了下面几句话就行了：
</p>
<pre class="example">
       cd `brew --prefix`
       git fetch origin
       git reset --hard origin/master
</pre>

<p>
最后一句是使用sudo才成功的。
</p>

<p>
据说就下面这样就行了：
</p>
<pre class="example">
       cd `brew --prefix`; git reset --hard
</pre>
</div>
</li>
</ol>
</div>
