wiki/Mac-wiki.org
*** DONE macports没有安装好，估计是墙的问题
    - State "DONE"       from "TODO"       [2015-02-17 二 09:16]
    在yemosite中现在还没有默认安装port。

    从源码安成功了。

    但是因为网络原因。没有port -v selfupdate成功。错误信息如下：
    #+BEGIN_EXAMPLE
       	Error: Failed to verify signature for MacPorts source!
      To report a bug, follow the instructions in the guide:
	  http://guide.macports.org/#project.tickets
      Error: /opt/local/bin/port: port selfupdate failed: Failed to verify signature for MacPorts source!
      pengpengxp@pengpengxpdeMacBook-Air:~$ man port
    #+END_EXAMPLE
    原因是没有使用sudo来update。

    homebrew可以安装一些简单的程序。很多lib包这些还是在port中才有，比如：libpcap这样的。
** 自动跳转的工具
   [[https://skyline75489.github.io/post/2014-12-13_j-z-and-fasd.html][这里]] 讲得很详细
*** autojump
**** DONE 安装autojump						   :autojump:
     - State "DONE"       from "TODO"       [2015-02-17 二 09:54]
     可以使用j来简单代替autojump命令。

     j -a <dir>来添加目录。这里设置的时候dir最好是绝对路径。

     然后使用j <something>就可以进行跳转了。something里面包括了将要跳转去的目录名字中的一部分就行了。
**** TODO autojump在bash能使用但是不能跳转
     - State "TODO"       from ""           [2015-02-17 二 09:57]
     jo是可以工作的。就是j不能跳转。
**** TODO eshell中使用autojump
     - State "TODO"       from ""           [2015-02-16 一 09:48]
     暂时没有弄eshell中的。下载了一个eshell-z来用着。
*** fasd
    git仓库在 [[https://github.com/clvv/fasd][这里]] 。

    可能是因为功能太多，terminal的反应都变慢了很多。
*** z
    使用shell-script写的。据说是更好的autojump。我使用起来感觉确实比较快。

    我需要使用zo来打开一个目录。自己写了一个函数：
    #+BEGIN_SRC sh
      function zo() {
	  z $1;
	  open ./
      }
    #+END_SRC

    需要的功能就是最简单的这两个。我最后选择了z。
**** eshell中使用z
     自己下载了一个eshell-z来用。感觉还不错。

** 创建智能文件夹						     :finder:
   #+BEGIN_EXAMPLE
     Finder提供了智能文件夹的功能，简单来说就是固化你的搜索条件，并形成文件夹存放在左侧边栏。
   例如你想建一个文件大小大于1G的智能文件夹，使用快捷键option+command+n呼出新建智能文件夹界面，点击最右侧的加号，在条件选择第一栏选择大小，第二栏选择大于，第三栏输入1G，你就可以看到你的Mac上文件大于1G的列表，点击存储，命名后该文件夹就会出现在左侧边栏。随时点击随时动态监控自己的硬盘上有哪些超过1G的大文件。试试其他搜索条件吧！
   #+END_EXAMPLE

** DONE 免费的Finder增强工具：XtraFinder			 :xtrafinder:
   - State "DONE"       from "TODO"       [2015-02-18 三 10:56]
   - State "TODO"       from ""           [2015-02-18 三 00:29]

   这个插件具备和TotalFinder类似的功能，支持tab、文件夹置顶、多窗口、剪切、全局热键等功能，重要的是这是一个完全免费的自由软件，而TotalFinder要18刀。
   下载网址：http://www.trankynam.com/xtrafinder/

   还不会使用。

   好像直接安装好后需要重启一下。

   它都有从这里启动的功能。可以代替go2shell的。

** pmset
    如果你想离开电脑一段时间，又不想让电脑进入睡眠状态，有个简单的命令 可以帮助你做到这一点。在终端中输入：pmset noidle，即可。只要该命令 一直运行，Mac就不会进入睡眠状态。关掉终端或ctrl+c可以取消该命令。

    pmset是OS X提供的命令行管理电源的工具，其功能远不止于此。

    pmset -g，查看当前电源的使用方案

    sudo pmset -b displaysleep 5，设置电池供电时，显示器5分钟内进入睡眠

    sudo pmset schedule wake "02/01/13 20:00:00"，设置电脑在2013年2月1日 晚8点唤醒电脑
** DONE 输入法问题
   - State "DONE"       from "TODO"       [2015-02-18 三 10:57]
   原生输入法不能据不同的程序调整出不同的状态。

   安装了搜狗输入法。将就用着。

   更推荐使用Rime
** Caffene
   可以使电有脑不自动休眠。个人感觉在下载大文件的时候比较有用。
** yesomite下U盘的默认的挂载目录
   #+BEGIN_EXAMPLE
   /Volumes/
   #+END_EXAMPLE
** DONE 一些gnu套件
   - State "DONE"       from "TODO"       [2015-02-24 二 11:24]
   使用brew安装coreutils。据说就是GNU套件。

   使用下面的命令来安装。
   #+BEGIN_EXAMPLE
     brew install coreutils findutils gnu-tar gnu-sed gawk gnutls gnu-indent gnu-getopt
   #+END_EXAMPLE

   还可以使用brew search gnu这些查看有什么东西。
** DONE 挂载的U盘不在/dev/sd*
   - State "DONE"       from "TODO"       [2015-02-24 二 15:54]
   linux才在/dev/sd*中。mac的磁盘在/dev/disk*。

   可以使用dd命令，通过输出到/dev/disk*来制作启动U盘。不过只是理论上可以，我还没有测试成功。

   测试windows xp失败。
** linux中的mkfs可以使用newfs_*来替代
** 使用reeder来查看rss
   据说是付费软件。先用着再说。
** 识别小米手机
   连上以后，可以直接安装AndroidFileTransfer.dmg。launchpad上显示名字叫android文件传输。

   然后可以使用它来访问小米手机中的数据了。
*** TODO 可以试试其它android设备
*** TODO android-adb for mac
** 开机就需要启动的程序						       :开机启动:
   | 名称       | 作用       |
   |------------+------------|
   | alfred     | 快捷键     |
   | 坚果云     | 同步       |
   | antirsi    | 保护身体   |
   | caffeine   | 一直不休眠 |
   | reeder     | 读rss      |
   | xtrafinder |            |
   | f.lux      | 调节色温   |

** gcc									:gcc:
   默认是安装了gcc的。但是是苹果版本的。

   现在[2015-02-25 三]

   可以使用homebrew来安装gcc-4.9。安装完成后，直接使用gcc-4.9来调用。
** DONE 虚拟机							    :virtual:
   - State "DONE"       from "TODO"       [2015-02-20 五 10:32]
   vmware fusion要收费。

   暂时先使用virtualbox。
** 挂载虚拟光驱
   使用下面的命令可以把some.iso挂载到`/Volumes/'下面：
   #+BEGIN_EXAMPLE
       hdiutil mount some.iso
   #+END_EXAMPLE
