wiki/Mac-wiki.html

<div id="outline-container-orga1f5719" class="outline-4">
<h4 id="orga1f5719"><span class="section-number-4">1.12.2</span> <span class="done DONE">DONE</span> macports没有安装好，估计是墙的问题</h4>
<div class="outline-text-4" id="text-1-12-2">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-17 二 09:16]</span></span></li>
</ul>
<p>
在yemosite中现在还没有默认安装port。
</p>

<p>
从源码安成功了。
</p>

<p>
但是因为网络原因。没有port -v selfupdate成功。错误信息如下：
</p>
<pre class="example">
       	Error: Failed to verify signature for MacPorts source!
      To report a bug, follow the instructions in the guide:
	  http://guide.macports.org/#project.tickets
      Error: /opt/local/bin/port: port selfupdate failed: Failed to verify signature for MacPorts source!
      pengpengxp@pengpengxpdeMacBook-Air:~$ man port
</pre>
<p>
原因是没有使用sudo来update。
</p>

<p>
homebrew可以安装一些简单的程序。很多lib包这些还是在port中才有，比如：libpcap这样的。
</p>
</div>
</div>
</div>
<div id="outline-container-org203810d" class="outline-3">
<h3 id="org203810d"><span class="section-number-3">1.13</span> 自动跳转的工具</h3>
<div class="outline-text-3" id="text-1-13">
<p>
<a href="https://skyline75489.github.io/post/2014-12-13_j-z-and-fasd.html">这里</a> 讲得很详细
</p>
</div>
<div id="outline-container-org1aade3e" class="outline-4">
<h4 id="org1aade3e"><span class="section-number-4">1.13.1</span> autojump</h4>
<div class="outline-text-4" id="text-1-13-1">
</div>
<ol class="org-ol">
<li><a id="orge0ea899"></a><span class="done DONE">DONE</span> 安装autojump&#xa0;&#xa0;&#xa0;<span class="tag"><span class="autojump">autojump</span></span><br />
<div class="outline-text-5" id="text-1-13-1-1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-17 二 09:54]</span></span></li>
</ul>
<p>
可以使用j来简单代替autojump命令。
</p>

<p>
j -a &lt;dir&gt;来添加目录。这里设置的时候dir最好是绝对路径。
</p>

<p>
然后使用j &lt;something&gt;就可以进行跳转了。something里面包括了将要跳转去的目录名字中的一部分就行了。
</p>
</div>
</li>
<li><a id="org92dc326"></a><span class="todo TODO">TODO</span> autojump在bash能使用但是不能跳转<br />
<div class="outline-text-5" id="text-1-13-1-2">
<ul class="org-ul">
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2015-02-17 二 09:57]</span></span></li>
</ul>
<p>
jo是可以工作的。就是j不能跳转。
</p>
</div>
</li>
<li><a id="org998b2b3"></a><span class="todo TODO">TODO</span> eshell中使用autojump<br />
<div class="outline-text-5" id="text-1-13-1-3">
<ul class="org-ul">
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2015-02-16 一 09:48]</span></span></li>
</ul>
<p>
暂时没有弄eshell中的。下载了一个eshell-z来用着。
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4a9a957" class="outline-4">
<h4 id="org4a9a957"><span class="section-number-4">1.13.2</span> fasd</h4>
<div class="outline-text-4" id="text-1-13-2">
<p>
git仓库在 <a href="https://github.com/clvv/fasd">这里</a> 。
</p>

<p>
可能是因为功能太多，terminal的反应都变慢了很多。
</p>
</div>
</div>
<div id="outline-container-org9a0bc8c" class="outline-4">
<h4 id="org9a0bc8c"><span class="section-number-4">1.13.3</span> z</h4>
<div class="outline-text-4" id="text-1-13-3">
<p>
使用shell-script写的。据说是更好的autojump。我使用起来感觉确实比较快。
</p>

<p>
我需要使用zo来打开一个目录。自己写了一个函数：
</p>
<div class="org-src-container">
<pre class="src src-sh">      <span style="color: PaleYellow;">function</span> <span style="color: #9acd32;">zo</span>() {
          z $<span style="color: #8fbc8f;">1</span>;
          open ./
      }
</pre>
</div>

<p>
需要的功能就是最简单的这两个。我最后选择了z。
</p>
</div>
<ol class="org-ol">
<li><a id="org4221564"></a>eshell中使用z<br />
<div class="outline-text-5" id="text-1-13-3-1">
<p>
自己下载了一个eshell-z来用。感觉还不错。
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org8d5c0e8" class="outline-3">
<h3 id="org8d5c0e8"><span class="section-number-3">1.14</span> 创建智能文件夹&#xa0;&#xa0;&#xa0;<span class="tag"><span class="finder">finder</span></span></h3>
<div class="outline-text-3" id="text-1-14">
<pre class="example">
     Finder提供了智能文件夹的功能，简单来说就是固化你的搜索条件，并形成文件夹存放在左侧边栏。
   例如你想建一个文件大小大于1G的智能文件夹，使用快捷键option+command+n呼出新建智能文件夹界面，点击最右侧的加号，在条件选择第一栏选择大小，第二栏选择大于，第三栏输入1G，你就可以看到你的Mac上文件大于1G的列表，点击存储，命名后该文件夹就会出现在左侧边栏。随时点击随时动态监控自己的硬盘上有哪些超过1G的大文件。试试其他搜索条件吧！
</pre>
</div>
</div>

<div id="outline-container-orgec5f37f" class="outline-3">
<h3 id="orgec5f37f"><span class="section-number-3">1.15</span> <span class="done DONE">DONE</span> 免费的Finder增强工具：XtraFinder&#xa0;&#xa0;&#xa0;<span class="tag"><span class="xtrafinder">xtrafinder</span></span></h3>
<div class="outline-text-3" id="text-1-15">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-18 三 10:56]</span></span></li>
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2015-02-18 三 00:29]</span></span></li>
</ul>

<p>
这个插件具备和TotalFinder类似的功能，支持tab、文件夹置顶、多窗口、剪切、全局热键等功能，重要的是这是一个完全免费的自由软件，而TotalFinder要18刀。
下载网址：<a href="http://www.trankynam.com/xtrafinder/">http://www.trankynam.com/xtrafinder/</a>
</p>

<p>
还不会使用。
</p>

<p>
好像直接安装好后需要重启一下。
</p>

<p>
它都有从这里启动的功能。可以代替go2shell的。
</p>
</div>
</div>

<div id="outline-container-org9dac94d" class="outline-3">
<h3 id="org9dac94d"><span class="section-number-3">1.16</span> pmset</h3>
<div class="outline-text-3" id="text-1-16">
<p>
如果你想离开电脑一段时间，又不想让电脑进入睡眠状态，有个简单的命令 可以帮助你做到这一点。在终端中输入：pmset noidle，即可。只要该命令 一直运行，Mac就不会进入睡眠状态。关掉终端或ctrl+c可以取消该命令。
</p>

<p>
pmset是OS X提供的命令行管理电源的工具，其功能远不止于此。
</p>

<p>
pmset -g，查看当前电源的使用方案
</p>

<p>
sudo pmset -b displaysleep 5，设置电池供电时，显示器5分钟内进入睡眠
</p>

<p>
sudo pmset schedule wake "02/01/13 20:00:00"，设置电脑在2013年2月1日 晚8点唤醒电脑
</p>
</div>
</div>
<div id="outline-container-org1ded5ba" class="outline-3">
<h3 id="org1ded5ba"><span class="section-number-3">1.17</span> <span class="done DONE">DONE</span> 输入法问题</h3>
<div class="outline-text-3" id="text-1-17">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-18 三 10:57]</span></span></li>
</ul>
<p>
原生输入法不能据不同的程序调整出不同的状态。
</p>

<p>
安装了搜狗输入法。将就用着。
</p>

<p>
更推荐使用Rime
</p>
</div>
</div>
<div id="outline-container-org7d7cffc" class="outline-3">
<h3 id="org7d7cffc"><span class="section-number-3">1.18</span> Caffene</h3>
<div class="outline-text-3" id="text-1-18">
<p>
可以使电有脑不自动休眠。个人感觉在下载大文件的时候比较有用。
</p>
</div>
</div>
<div id="outline-container-org5f5dc13" class="outline-3">
<h3 id="org5f5dc13"><span class="section-number-3">1.19</span> yesomite下U盘的默认的挂载目录</h3>
<div class="outline-text-3" id="text-1-19">
<pre class="example">
   /Volumes/
</pre>
</div>
</div>
<div id="outline-container-org4ec75fb" class="outline-3">
<h3 id="org4ec75fb"><span class="section-number-3">1.20</span> <span class="done DONE">DONE</span> 一些gnu套件</h3>
<div class="outline-text-3" id="text-1-20">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-24 二 11:24]</span></span></li>
</ul>
<p>
使用brew安装coreutils。据说就是GNU套件。
</p>

<p>
使用下面的命令来安装。
</p>
<pre class="example">
     brew install coreutils findutils gnu-tar gnu-sed gawk gnutls gnu-indent gnu-getopt
</pre>

<p>
还可以使用brew search gnu这些查看有什么东西。
</p>
</div>
</div>
<div id="outline-container-org5e0b55f" class="outline-3">
<h3 id="org5e0b55f"><span class="section-number-3">1.21</span> <span class="done DONE">DONE</span> 挂载的U盘不在/dev/sd*</h3>
<div class="outline-text-3" id="text-1-21">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-24 二 15:54]</span></span></li>
</ul>
<p>
linux才在/dev/sd*中。mac的磁盘在/dev/disk*。
</p>

<p>
可以使用dd命令，通过输出到/dev/disk*来制作启动U盘。不过只是理论上可以，我还没有测试成功。
</p>

<p>
测试windows xp失败。
</p>
</div>
</div>
<div id="outline-container-org5219047" class="outline-3">
<h3 id="org5219047"><span class="section-number-3">1.22</span> linux中的mkfs可以使用newfs<sub>*</sub>来替代</h3>
</div>
<div id="outline-container-org20e29bd" class="outline-3">
<h3 id="org20e29bd"><span class="section-number-3">1.23</span> 使用reeder来查看rss</h3>
<div class="outline-text-3" id="text-1-23">
<p>
据说是付费软件。先用着再说。
</p>
</div>
</div>
<div id="outline-container-org353bde8" class="outline-3">
<h3 id="org353bde8"><span class="section-number-3">1.24</span> 识别小米手机</h3>
<div class="outline-text-3" id="text-1-24">
<p>
连上以后，可以直接安装AndroidFileTransfer.dmg。launchpad上显示名字叫android文件传输。
</p>

<p>
然后可以使用它来访问小米手机中的数据了。
</p>
</div>
<div id="outline-container-org35465e8" class="outline-4">
<h4 id="org35465e8"><span class="section-number-4">1.24.1</span> <span class="todo TODO">TODO</span> 可以试试其它android设备</h4>
</div>
<div id="outline-container-org6a3c866" class="outline-4">
<h4 id="org6a3c866"><span class="section-number-4">1.24.2</span> <span class="todo TODO">TODO</span> android-adb for mac</h4>
</div>
</div>
<div id="outline-container-org67e6942" class="outline-3">
<h3 id="org67e6942"><span class="section-number-3">1.25</span> 开机就需要启动的程序&#xa0;&#xa0;&#xa0;<span class="tag"><span class="____">开机启动</span></span></h3>
<div class="outline-text-3" id="text-1-25">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">alfred</td>
<td class="org-left">快捷键</td>
</tr>

<tr>
<td class="org-left">坚果云</td>
<td class="org-left">同步</td>
</tr>

<tr>
<td class="org-left">antirsi</td>
<td class="org-left">保护身体</td>
</tr>

<tr>
<td class="org-left">caffeine</td>
<td class="org-left">一直不休眠</td>
</tr>

<tr>
<td class="org-left">reeder</td>
<td class="org-left">读rss</td>
</tr>

<tr>
<td class="org-left">xtrafinder</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">f.lux</td>
<td class="org-left">调节色温</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc1a3b34" class="outline-3">
<h3 id="orgc1a3b34"><span class="section-number-3">1.26</span> gcc&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gcc">gcc</span></span></h3>
<div class="outline-text-3" id="text-1-26">
<p>
默认是安装了gcc的。但是是苹果版本的。
</p>

<p>
现在<span class="timestamp-wrapper"><span class="timestamp">[2015-02-25 三]</span></span>
</p>

<p>
可以使用homebrew来安装gcc-4.9。安装完成后，直接使用gcc-4.9来调用。
</p>
</div>
</div>
<div id="outline-container-org965211c" class="outline-3">
<h3 id="org965211c"><span class="section-number-3">1.27</span> <span class="done DONE">DONE</span> 虚拟机&#xa0;&#xa0;&#xa0;<span class="tag"><span class="virtual">virtual</span></span></h3>
<div class="outline-text-3" id="text-1-27">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2015-02-20 五 10:32]</span></span></li>
</ul>
<p>
vmware fusion要收费。
</p>

<p>
暂时先使用virtualbox。
</p>
</div>
</div>
<div id="outline-container-org3cb538f" class="outline-3">
<h3 id="org3cb538f"><span class="section-number-3">1.28</span> 挂载虚拟光驱</h3>
<div class="outline-text-3" id="text-1-28">
<p>
使用下面的命令可以把some.iso挂载到`/Volumes/'下面：
</p>
<pre class="example">
       hdiutil mount some.iso
</pre>
</div>
</div>
