wiki/Mac-wiki.html
<div id="outline-container-org1235b47" class="outline-3">
<h3 id="org1235b47"><span class="section-number-3">1.29</span> dia在yesomite中闪退，capitan中也启动不起来</h3>
<div class="outline-text-3" id="text-1-29">
<p>
需要安装 <a href="https://xquartz.macosforge.org/landing/">XQuatz</a>&#x2013;&gt; A version of the X.Org X Window System that runs on OS X
</p>

<p>
<a href="http://navkirats.blogspot.com.ar/2014/10/dia-diagram-mac-osx-yosemite-fix-i-use.html">here</a> 找到的答案
</p>

<p>
这样就可以了：
</p>
<pre class="example">
     Goto your Applications directory where Dia.app exists (mine was located at: /Applications)
     Right click the icon and click on Show Package Contents
     Goto the directory Dia.app/Contents/Resources/bin
     Edit the file dia, in your favourite text editor.
     After line 39, add the line: export DISPLAY=:0
     Save and exit.
     Close XQuartz if its running.
     Now Dia should come up.
     If it does not come up, try restarting your computer.
</pre>

<p>
其实这个dia是一个脚本文件，闪退就是因为环境变量的问题。直接在其中加
入就行了。
我修改后的dia文件是这样的：
</p>
<div class="org-src-container">
<pre class="src src-sh">     <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">!/bin/sh</span>
     <span style="color: #cd5c5c;">#</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Author: Aaron Voisine <a href="mailto:aaron%40voisine.org">&lt;aaron@voisine.org&gt;</a></span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Modifications:</span>
     <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">Michael Wybrow <a href="mailto:mjwybrow%40users.sourceforge.net">&lt;mjwybrow@users.sourceforge.net&gt;</a></span>
     <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">Jean-Olivier Irisson <a href="mailto:jo.irisson%40gmail.com">&lt;jo.irisson@gmail.com&gt;</a></span>
     <span style="color: #cd5c5c;">#       </span><span style="color: #cd5c5c;">Steffen Macke <a href="mailto:sdteffen%40sdteffen.de">&lt;sdteffen@sdteffen.de&gt;</a></span>

     <span style="color: #8fbc8f;">CWD</span>=<span style="color: #ffa500;">"`(cd \"\`dirname \\\"$0\\\"\`\"; echo \"$PWD\")`"</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">e.g. /Applications/Dia.app/Contents/Resources/bin</span>
     <span style="color: #8fbc8f;">TOP</span>=<span style="color: #ffa500;">"`dirname \"$CWD\"`"</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">e.g. /Applications/Dia.app/Contents/Resources</span>

     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Brutally add many things to the PATH. If the directories do not exist, they won't be used anyway.</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">People should really use ~/.macosx/environment.plist to set environment variables as explained by Apple:</span>
     <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">http://developer.apple.com/qa/qa2001/qa1067.html</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">but since no one does, we correct this by making the 'classic' PATH additions here:</span>
     <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">/usr/local/bin which, though standard, doesn't seem to be in the PATH</span>
     <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">newer python as recommended by MacPython http://www.python.org/download/mac/</span>
     <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">Fink</span>
     <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">MacPorts (former DarwinPorts)</span>
     <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">LaTeX distribution for Mac OS X</span>
     <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">export PATH="/usr/texbin:/opt/local/bin:/sw/bin/:/Library/Frameworks/Python.framework/Versions/Current/bin:/usr/local/bin:$CWD:$PATH"</span>

     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Check for X11</span>
     <span style="color: PaleYellow;">if</span> [[ <span style="color: #ffa500;">""</span> == $<span style="color: #8fbc8f;">DISPLAY</span> ]]; <span style="color: PaleYellow;">then</span>
       <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DISPLAY</span>=:0
     <span style="color: PaleYellow;">fi</span>
     <span style="color: #8fbc8f;">startx</span>=<span style="color: #fa8072;">`which startx`</span>
     <span style="color: PaleYellow;">if</span> [[ <span style="color: #ffa500;">""</span> == $<span style="color: #8fbc8f;">startx</span> ]]; <span style="color: PaleYellow;">then</span>
      <span style="color: PaleYellow;">if</span> [[ ! -e /opt/X11/bin/startx ]]; <span style="color: PaleYellow;">then</span>
        osascript -e <span style="color: #ffa500;">'tell app "System Events" to display dialog "X11 (XQuartz) is not installed or not running. Would you like to visit xquartz.macosforge.org now in order to download and install XQuartz?" with icon 0'</span>
        <span style="color: PaleYellow;">if</span> [[ $<span style="color: #8fbc8f;">?</span> -eq 0 ]]; <span style="color: PaleYellow;">then</span>
          open http://xquartz.macosforge.org
          <span style="color: PaleYellow;">exit</span>
        <span style="color: PaleYellow;">fi</span>
       <span style="color: PaleYellow;">fi</span>
     <span style="color: PaleYellow;">fi</span>

     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DISPLAY</span>=:0

     osascript -e <span style="color: #ffa500;">'tell app "XQuartz" to launch'</span>
     <span style="color: PaleYellow;">for</span> i<span style="color: PaleYellow;"> in</span> <span style="color: #fa8072;">`seq 1 30`</span>; <span style="color: PaleYellow;">do</span>
       <span style="color: PaleYellow;">if</span> [[ <span style="color: #fa8072;">`ps aux | grep -v grep | grep startx | wc -l`</span> -lt 1 ]]; <span style="color: PaleYellow;">then</span>
         sleep 1
       <span style="color: PaleYellow;">fi</span>
     <span style="color: PaleYellow;">done</span>
     <span style="color: PaleYellow;">if</span> [[ <span style="color: #ffa500;">"$DISPLAY"</span> =~ <span style="color: #ffa500;">"/tmp"</span> ]]; <span style="color: PaleYellow;">then</span>
       <span style="color: PaleYellow;">if</span> [[ ! -e $<span style="color: #8fbc8f;">DISPLAY</span> ]]; <span style="color: PaleYellow;">then</span>
         <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DISPLAY</span>=:0
       <span style="color: PaleYellow;">fi</span>
     <span style="color: PaleYellow;">fi</span>

     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Setup PYTHONPATH to use python modules shipped with Dia</span>
     <span style="color: #8fbc8f;">ARCH</span>=<span style="color: #fa8072;">`arch`</span>
     <span style="color: #8fbc8f;">PYTHON_VERS</span>=<span style="color: #fa8072;">`python -V 2&gt;&amp;1 | cut -c 8-10`</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">PYTHONPATH</span>=<span style="color: #ffa500;">"$TOP/python/site-packages/$ARCH/$PYTHON_VERS"</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">NB: we are only preprending some stuff to the default python path so if the directory does not exist it should not harm the rest</span>

     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">No longer required if path rewriting has been conducted.</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DYLD_FALLBACK_LIBRARY_PATH</span>=<span style="color: #ffa500;">"$TOP/lib"</span>

     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DIA_BASE_PATH</span>=<span style="color: #ffa500;">"$TOP"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DIA_LIB_PATH</span>=<span style="color: #ffa500;">"$TOP/dia"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DIA_SHEET_PATH</span>=<span style="color: #ffa500;">"$TOP/sheets"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DIA_SHAPE_PATH</span>=<span style="color: #ffa500;">"$TOP/shapes"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DIA_XSLT_PATH</span>=<span style="color: #ffa500;">"$TOP/xslt"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DIA_SHAREDIR</span>=<span style="color: #ffa500;">"$TOP"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">DIA_LOCALE_PATH</span>=<span style="color: #ffa500;">"$TOP/share/locale"</span>

     mkdir -p <span style="color: #ffa500;">"${HOME}/.dia-etc"</span>

     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">FONTCONFIG_PATH</span>=<span style="color: #ffa500;">"$TOP/etc/fonts"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">PANGO_RC_FILE</span>=<span style="color: #ffa500;">"$HOME/.dia-etc/pangorc"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">GTK_IM_MODULE_FILE</span>=<span style="color: #ffa500;">"$HOME/.dia-etc/gtk.immodules"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">GDK_PIXBUF_MODULE_FILE</span>=<span style="color: #ffa500;">"$HOME/.dia-etc/gdk-pixbuf.loaders"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">GTK_DATA_PREFIX</span>=<span style="color: #ffa500;">"$TOP"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">GTK_EXE_PREFIX</span>=<span style="color: #ffa500;">"$TOP"</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">XDG_DATA_DIRS</span>=<span style="color: #ffa500;">"$TOP/share"</span>

     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Handle the case where the directory storing Dia has special characters</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">('#', '&amp;', '|') in the name.  These need to be escaped to work properly for</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">various configuration files.</span>
     <span style="color: #8fbc8f;">ESCAPEDTOP</span>=<span style="color: #fa8072;">`echo "$TOP" | sed 's/#/\\\\\\\\#/' | sed 's/&amp;/\\\\\\&amp;/g' | sed 's/|/\\\\\\|/g'`</span>

     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Set GTK theme (only if there is no .gtkrc-2.0 in the user's home)</span>
     <span style="color: PaleYellow;">if</span> [[ ! -e <span style="color: #ffa500;">"$HOME/.gtkrc-2.0"</span> ]]; <span style="color: PaleYellow;">then</span>
             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Appearance setting</span>
             <span style="color: #8fbc8f;">aquaStyle</span>=<span style="color: #fa8072;">`defaults read "Apple Global Domain" AppleAquaColorVariant 2&gt;/dev/null`</span>
             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">1 for aqua, 6 for graphite, inexistant if the default color was never changed</span>
             <span style="color: PaleYellow;">if</span> [[ <span style="color: #ffa500;">"$aquaStyle"</span> == <span style="color: #ffa500;">""</span> ]]; <span style="color: PaleYellow;">then</span>
                     <span style="color: #8fbc8f;">aquaStyle</span>=1                <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">set aqua as default</span>
             <span style="color: PaleYellow;">fi</span>

             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Highlight Color setting</span>
             <span style="color: #8fbc8f;">hiliColor</span>=<span style="color: #fa8072;">`defaults read "Apple Global Domain" AppleHighlightColor 2&gt;/dev/null`</span>
             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">a RGB value, with components between 0 and 1, also inexistant if it was not changed</span>
             <span style="color: PaleYellow;">if</span> [[ <span style="color: #ffa500;">"$hiliColor"</span> == <span style="color: #ffa500;">""</span> ]]; <span style="color: PaleYellow;">then</span>
                     <span style="color: #8fbc8f;">hiliColor</span>=<span style="color: #ffa500;">"0.709800 0.835300 1.000000"</span>     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">set blue as default</span>
             <span style="color: PaleYellow;">fi</span>

             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Menu items color</span>
             <span style="color: PaleYellow;">if</span> [[ aquaStyle -eq 1 ]]; <span style="color: PaleYellow;">then</span>
                     <span style="color: #8fbc8f;">menuColor</span>=<span style="color: #ffa500;">"#4a76cd"</span>        <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">blue</span>
             <span style="color: PaleYellow;">else</span>
                     <span style="color: #8fbc8f;">menuColor</span>=<span style="color: #ffa500;">"#7c8da4"</span>        <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">graphite</span>
             <span style="color: PaleYellow;">fi</span>
             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Format highlight color as a GTK rgb value</span>
             <span style="color: #8fbc8f;">hiliColorFormated</span>=<span style="color: #fa8072;">`echo $hiliColor | awk -F " " '{print "\\\{"$1","$2","$3"\\\}"}'`</span>

             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">echo $menuColor</span>
             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">echo $hiliColorFormated</span>

             <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">Modify the gtkrc</span>
             <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">- with the correct colors</span>
             <span style="color: #cd5c5c;">#  </span><span style="color: #cd5c5c;">- to point to the correct scrollbars folder</span>
             sed <span style="color: #ffa500;">'s/OSX_HILI_COLOR_PLACEHOLDER/'</span>$<span style="color: #8fbc8f;">hiliColorFormated</span><span style="color: #ffa500;">'/g'</span> <span style="color: #ffa500;">"$DIA_SHAREDIR/themes/CL/gtk-2.0/pre_gtkrc"</span> | sed <span style="color: #ffa500;">'s/OSX_MENU_COLOR_PLACEHOLDER/\"'</span>$<span style="color: #8fbc8f;">menuColor</span><span style="color: #ffa500;">'\"/g'</span> | sed <span style="color: #ffa500;">'s/AQUASTYLE_PLACEHOLDER/'</span>$<span style="color: #8fbc8f;">aquaStyle</span><span style="color: #ffa500;">'/g'</span> | sed <span style="color: #ffa500;">'s|${THEMEDIR}|'"$ESCAPEDTOP/themes/CL/gtk-2.0|g"</span> &gt; <span style="color: #ffa500;">"${HOME}/.dia-etc/gtkrc"</span>

             <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">GTK2_RC_FILES</span>=<span style="color: #ffa500;">"$HOME/.dia-etc/gtkrc"</span>
     <span style="color: PaleYellow;">fi</span>

     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">If the AppleCollationOrder preference doesn't exist, we fall back to using</span>
     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">the AppleLocale preference.</span>
     <span style="color: #8fbc8f;">LANGSTR</span>=<span style="color: #fa8072;">`defaults read .GlobalPreferences AppleCollationOrder 2&gt;/dev/null`</span>
     <span style="color: PaleYellow;">if</span> [ <span style="color: #ffa500;">"x$LANGSTR"</span> == <span style="color: #ffa500;">"x"</span> ]
     <span style="color: PaleYellow;">then</span>
         <span style="color: #b0c4de;">echo</span> <span style="color: #ffa500;">"Warning: AppleCollationOrder setting not found, using AppleLocale."</span> 1&gt;&amp;2
         <span style="color: #8fbc8f;">LANGSTR</span>=<span style="color: #fa8072;">`defaults read .GlobalPreferences AppleLocale 2&gt;/dev/null | \</span>
<span style="color: #fa8072;">                 sed 's/_.*//'`</span>
     <span style="color: PaleYellow;">fi</span>

     <span style="color: #cd5c5c;"># </span><span style="color: #cd5c5c;">NOTE: Have to add ".UTF-8" to the LANG since omitting causes Dia</span>
     <span style="color: #cd5c5c;">#       </span><span style="color: #cd5c5c;">to crash on startup in locale_from_utf8().</span>
     <span style="color: #b0c4de;">export</span> <span style="color: #8fbc8f;">LANG</span>=<span style="color: #ffa500;">"$LANGSTR.UTF8"</span>
     <span style="color: #b0c4de;">echo</span> <span style="color: #ffa500;">"Setting Language: $LANG"</span> 1&gt;&amp;2

     sed <span style="color: #ffa500;">'s|${HOME}|'"$HOME|g"</span> <span style="color: #ffa500;">"$TOP/etc/pango/pangorc"</span> &gt; <span style="color: #ffa500;">"${HOME}/.dia-etc/pangorc"</span>
     sed <span style="color: #ffa500;">'s|${CWD}|'"$ESCAPEDTOP|g"</span> <span style="color: #ffa500;">"$TOP/etc/pango/pango.modules"</span> <span style="color: #ffa500;">\</span>
         &gt; <span style="color: #ffa500;">"${HOME}/.dia-etc/pango.modules"</span>
     cp -f <span style="color: #ffa500;">"$TOP/etc/pango/pangox.aliases"</span> <span style="color: #ffa500;">"${HOME}/.dia-etc/"</span>
     sed <span style="color: #ffa500;">'s|${CWD}|'"$ESCAPEDTOP|g"</span> <span style="color: #ffa500;">"$TOP/etc/gtk-2.0/gtk.immodules"</span> <span style="color: #ffa500;">\</span>
         &gt; <span style="color: #ffa500;">"${HOME}/.dia-etc/gtk.immodules"</span>
     sed <span style="color: #ffa500;">'s|${CWD}|'"$ESCAPEDTOP|g"</span> <span style="color: #ffa500;">"$TOP/etc/gtk-2.0/gdk-pixbuf.loaders"</span> <span style="color: #ffa500;">\</span>
         &gt; <span style="color: #ffa500;">"${HOME}/.dia-etc/gdk-pixbuf.loaders"</span>

     <span style="color: PaleYellow;">exec</span> <span style="color: #ffa500;">"$CWD/dia-bin"</span> --integrated

</pre>
</div>
</div>
</div>
