wiki/Mac-wiki.org
** 安装和使用gnuplot

   直接使用`brew install gnuplot'后使用plot命令会出现`unknown terminal'的问题。

   [[http://apple.stackexchange.com/questions/103814/cant-plot-with-gnuplot-on-my-mac][here]] 找到了答案。

   使用下面的命令来使用`X11'作为terminal。但是这需要安装上 [[https://xquartz.macosforge.org/landing/][XQuatz]]。
   #+BEGIN_EXAMPLE
   brew install gnuplot --with-x11
   #+END_EXAMPLE

   上面还说可以这样：
   #+BEGIN_EXAMPLE
     You can also save the output to a file and use qlmanage -p:

     gnuplot -e 'set term png; set output "/tmp/plot.png"; plot sin(x)'; qlmanage -p /tmp/plot.png

     qlmanage -p shows a sandboxing error in 10.9 and prints some unnecessary text to STDOUT, so I use a function like ql() { qlmanage -p "$@"&>/dev/null; } in shells.

     A third option is to use set term dumb for plain text output.
   #+END_EXAMPLE
** DONE 没有使用默认的邮箱
    - State "DONE"       from "TODO"       [2015-03-13 五 16:16]
    因为它对新浪邮箱支持不是很好，以后有机会再试吧。
** DONE dmg文件安装完成后在桌面上还有残留
    - State "DONE"       from "TODO"       [2015-03-13 五 16:21]
    其实就是挂载了它。在桌面或者finder中推出就好了。

** 在mac中修改按键设定				       :change_key:karabiner:
   :PROPERTIES:
   :keyword:  karabiner
   :END:
*** Karabiner
    <<karabiner>>
    是主要改键的。请查看pdf来改键。不只可以remap。还可以修改按键重复的快慢等。功能很强大，有待进一步使用发掘功能。

*** seil
    主要是使用来修改capslock按键的。我也不知道为什么capslock需要一个单独的程序来修改它。

    * 注意 *

    修改capslock时 [[file:Seil%20-%20Software%20for%20OS%20X.pdf][file:~/Downloads/mac_change_key/Seil - Software for OS X.pdf]] 中也说了。需要在设置->键盘中修改一下修饰键，将capslock修改为无操作。

*** 使用CapsLock一个按键打开alfred
    <<alfred-karabiner>>

    从 [[http://computers.tutsplus.com/tutorials/how-to-make-better-use-of-the-caps-lock-key--mac-56350][这里]] 看到的。

    间单讲，就是用seil把CapsLock remap到一个不存在的按键`f19'，keycode是80.

    然后在alfred的设置中选择这个键就行了。

*** 通过karabiner使用我的filco键盘
    使用mac自带的键盘打久了手还是痛，换成filco。

    在karabiner中把`swap command_l and option_L *** filco ***'打开。然后就基本可以使用了。
** DONE 控制mac的剪切板
   - State "DONE"       from "TODO"       [2015-03-13 五 21:47]
     使用了clipmenu。将就用着。

     据说还有clyppan。没有用成。
   <2015-03-13 五 20:56>

** 使用鼠标					 :mouse:鼠标:reverse:scrolling:
   黙认鼠标滚动是和win是相反的。用起来很不习惯。在system设置反过来吧，触摸板又反了。很不好用。

   结果使用了reverse scrolling这款软件行可以调整过来。

   *注意*
   --------------------------------------------------------------------------------
   1) 这个软件会让三个手头查字典的功能变没有了。
   --------------------------------------------------------------------------------

** 截图						      :jietu:capture_picture:
   看的网上的
   #+BEGIN_EXAMPLE
      baifeng.me
     如何在Mac OS X上截图 - 柏枫 | baifeng 博客 苹果 mac iphone ipad ipod os web html css javascript 网页 平面 设计
     1 min read  original
     如何在Mac OS X上截图 - 柏枫苹果为Mac OS X提供了丰富的截图工具，但大部分用户很少会用到甚至也都不知道，今天摘出一部分方便易用的截图小技巧。

     Mac OS X自带的截图工具名叫Grab，在[应用程序] – [实用工具]里，但我们先来看点基本的。

     1. 同时按下快捷键Command+Shift+3可以将整个屏幕以.png格式图片保存到桌面上，如果不想直接保存成文件，就按Command+Control+Shift+3，把桌面保存到剪切板。

     2. 如果不想保存整个桌面，而是想像QQ截图那样自选一块区域，当然你可以用QQ，Mac版QQ也有这个功能。或者按下快捷键Command+Shift+4，光标就会变成一个准星，选择一个区域然后就会以.png保存到桌面，同样如果想保存到剪切板就按Command+Control+Shift+4。不过在10.3以前，这个操作是保存成PDF的。

     3. 如果想保存某个窗口，也不必谨小慎微地画框框，按按Command+(Control)+Shift+4，然后按空格，小准星就会变成一架相机，然后点你想截图的窗口即可，保存下来的仍是24位无损透明背景的.png图片，最妙的是带阴影的。

     4. 如果想要更多控制选项的话，就要借助软件了，首先就是自带的Grab。比如你想在截图中保留鼠标指针、菜单，都可以用Grab。打开Grab之后，点Grab菜单名-首选项，然后选择你需要的鼠标状态。设置好了以后点击，Capture(抓图)菜单下的区域、窗口、屏幕和计时截图。计时就是按下截图之后，系统会给你10秒钟的时间准备，比如开启某些菜单或窗口，玩过自拍的都知道。

     如果觉得上面这些还不能满足你的需要，那么就要借助第三方的软件了，这里推荐4款比较有代表性的。

     LittleSnapper
     正版售价: $39
     开发团队: Realmac Software
     系统需求: Mac OS X 10.5+

     LittleSnapper不仅可以截取桌面图片还可以截取整个网页，并提供了实用的编辑工具。

     SnapzProX
     4款推荐中最贵的，但也是唯一支持视频录制的截图软件，当然在截取静态图片方面也有不俗的表现。

     正版: $69
     开发团队: Ambrosia Software
     系统需求: Mac OS X 10.3.9+

     Layers
     顾名思义，Layers可以将你屏幕上的所有内容截取成Photoshop的PSD图层文件，每一个图层都表示不同的应用程序和界面元素，同时你也可以自行定义一些选项。

     正版售价: $19.95
     开发团队: Wuonm
     系统需求: Mac OS X 10.5+

     Voila
     Voila允许你抓取多种来源的内容，添加各种炫酷效果。然后一键发送电子右键、上传Flickr、保存iPhoto等等。

     正版售价: $39.95
     开发团度: Global Delight
     系统需求: Mac OS X 10.5.2+
   #+END_EXAMPLE

** hyperswitch
   在同一个程序中切换不同的窗口。比如preview中窗口太多了，用原生的`command + ~'不太爽。使用hyperswitch可以配置成用`option+Tab'切换。还不错。

** 突然不能打开 网络设置 的面板
   这样解决的：
   #+BEGIN_EXAMPLE
      1.打开Finder 前往以下地址：
     /Library/Preferences/SystemConfiguration
     2.删除
     com.apple.airport.preferences.plist
     com.apple.network.eapolclient.configuration.plist
     com.apple.wifi.message-tracer.plist
     NetworkInterfaces.plist
     preferences.plist
     注：机型不同，自行删除network配置
     3.重启进入recoveryHD 全盘权限修复
     重启应该可以配置了
   #+END_EXAMPLE

   可以直接使用下面的命令（整成脚本运行）：
   #+BEGIN_SRC sh
     cd      /Library/Preferences/SystemConfiguration
     sudo mv com.apple.airport.preferences.plist com.apple.network.eapolclient.configuration.plist\\
     com.apple.wifi.message-tracer.plist NetworkInterfaces.plist preferences.plist /tmp/
   #+END_SRC

** 窗口管理					     :manage:windows:maxmize:
*** 最大化窗口
    默认mac中的最大化叫缩放（服了）。在键盘->应用程序快捷键下添加一快捷键：名字就叫缩放。自己弄个快捷键就行了。
*** 使用了slate来管理窗口					      :slate:
    我发现我只需要其中的`command+alt+<up,down,left,right>'这些操作。而且其中有些和emacs中的操作冲突了。所以在配置文件中都注释掉了。只留下几句有用的：
    #+BEGIN_EXAMPLE
      config defaultToCurrentScreen true
      config nudgePercentOf screenSize
      config resizePercentOf screenSize

      # Push Bindings
      bind right:ctrl;cmd  push right bar-resize:screenSizeX/3
      bind left:ctrl;cmd   push left  bar-resize:screenSizeX/3
      bind up:ctrl;cmd     push up    bar-resize:screenSizeY/2
      bind down:ctrl;cmd   push down  bar-resize:screenSizeY/2
    #+END_EXAMPLE

    但是slate在我的机器上操作finder的时候可能产生出黑色的东西。bug!
*** TODO moom 该软件还没有使用过
** 禁止了cnnic证书
   在钥匙串访问->系统根证书->证书中找到了cnnic证书。设置为了永不信任。

