wiki/Mac-wiki.org
** 从源码编译emacs						      :emacs:
   下载源码。

   查看INSTALL。mac下需要查看netxstep/INSTALL。里面提示使用下面的命令：
   #+BEGIN_EXAMPLE
     ./configure --with-ns
     make install
   #+END_EXAMPLE

   第一个`--with-ns'使emacs成为一个standalone的程序。

   `make install'不会进行安装。这是在`nextstep/'下生成了一个Emacs.app。可以直接使用的。可以拷贝它到任何地方了。

   在mac上编译emacs只能说是简单得令人发紫。只依赖`autoconf,automake'这些，而这些工具在安装`xcode'的时候就已经安装上了。

   另外，默认的`emacsclient'是针对mac中自代的emacs-22的。从源码编译后，在`bin'文件夹中会有`emacsclient'。自民做一个软链接就行罗。

** mac中的gdb
   mac中使用lldb来代替了gdb。但是有时候还是需要使用gdb。可以使用Macport来安装。

   #+BEGIN_EXAMPLE
     sudo port install gdb-apple
   #+END_EXAMPLE

   然后可以使用`gdb-apple'来调试。但是使用mac默认的编译器编出来的，貌似只能使用lldb来调试了。使用`apple-gcc'编译的应该可以。不过我的apple-gcc没有下载下来，就没有尝试。

** 在mac中使用swift编程						      :swift:
   可以在xcode中建立工程。但是我喜欢这种方法。可以使用terminal的方式。如下：

   使用`xcrun swift'可以进行一个交互式的swift解释器，然后可以`println("Hello,world");'。

   可以把`println("Hello,world")'写入一个文件`hello.swift'中，然后使用`scrun swift hello.swift'运行。

   还可以把`hello,swift'写成一个脚本，在开关加入`/usr/bin/xcrun swift'。修改权限可以运行的。这里`xcrun'是通过`which'查出来的。

   其实是可以直接使用`swift'命令的。这个的作用就和`xcrun swift'是一样的。

   也有`swift'的编译器->`swiftc'。可以`swiftc hello.swift -o hello'编译出来执行。（默认编译出来就是hello，使用`-o'选项可以控制下）。
** DONE 对ntfs的磁盘只读
   可以使用`mount_ntfs'命令来做。我不知道这个命令是mac自带的还是我下载了什么`ntfs*'软件给我的。

   可以使用`diskutil info'已挂载的磁盘的信息。比如我就用`diskutil info /Volumes/win7'。查出来我的是`/dev/disk3s2'。

   使用`diskutil eject /dev/disk3s2'来先推出。使用只有一个分驱的u盘时
   不能用eject推出了，推出就找不到了磁盘了。需要使用`diskutil umount
   /dev/disk3s2'卸载。

   然后使用`sudo mount_ntfs -o rw,nobrowse /dev/disk3s2 /tmp'将其挂载到`/tmp'下。现在就可读也可写了。

   这个解决办法不是最理想的。可不可以有更好的？
** macbook合住盖子而不进入待机
   InsomniaX 一个插件可以做到
** 录制Gif图片
   licecap录制gif图片，很方便。
** cdto
   可以在finder中添加一个icon，实现在当前文件夹中打开iTerm2或者terminal的功能。

** just focus 番茄工作法加定时锁屏，常用软件
** TODO 待办
*** TODO 从源码安装了wget后，从bash中启动emacs可以找到，但是从launchpad中启动还是提示找不到wget

*** TODO 查字典
    sdcv在brew中直接就有。可以直接安装。安装过程中还安装了依赖cmake。
*** TODO 通过zip安装的软件
    从zip解压直接点击用的，还不知道怎么完全弄到电脑上来用。iterm2,opera都是这样的。
*** TODO 不断网锁屏
*** TODO 连接各种外设
*** TODO microsoft-office使用brew没有下载下来。不行不装了。就用iwork。
*** TODO 禁用触摸板
    我发现如果手掌放到触摸板上鼠标是不会动的。苹果设计的很好哦。
*** TODO 把下载中的内容归类。软件这些都保存起来。
*** TODO finder中使用`/'来进入某一文件夹
    默认是使用`shift+command+G'。我觉得很不方便。但是没有找到合适的办法。
*** TODO mou可以用来写markdown
    不过没有使用过。
*** TODO jitouch功能更强大的多点触控软件
    没有使用；
*** TODO 不像linux一样可以使用fdisk直接对U盘这些进行分区
*** TODO 文档查看器
**** dash
     收费，试用阶段。不付费每次打开会有8秒钟等待时间。

**** TODO zeal
     - State "TODO"       from ""           [2015-02-18 三 01:06]
     mac上默认没有。需要从源码中安装。还没有安装。

     [[https://www.google.com/url?sa%3Dt&rct%3Dj&q%3D&esrc%3Ds&source%3Dweb&cd%3D2&ved%3D0CCgQFjAB&url%3Dhttp%253A%252F%252Fwww.hjue.me%252Fpost%252FCompile-Zear-on-Mac-OS-X&ei%3DdnPjVOrlFoKmoQSinYDQCw&usg%3DAFQjCNGKoLPfKnDimO4sYw-Vah8dDCBBxg&sig2%3DVSHZlix7MF17GAoD8ipORw&bvm%3Dbv.85970519,d.cGU&cad%3Drjt][这里]] 看到的。

**** TODO emacs-dash？
     也有这样的功能？

*** TODO mount和route命令和linux上不同

*** TODO clamAV for mac
    安装好了但是还没有配置。
*** TODO jabref
    可不可以直接从chrome中使用jabref打开就直接导入进去了。这样很方便？
*** TODO wireshark
    通过brew cask安装好了。但是每次都要问X11安装在哪儿了。找到了又不能点击。
*** TODO 不从terminal启动emacs，则一些环境变量没有设置正确

** calibre管理书籍
   使用 =calibre= 。可以导出epub拱ibooks使用。
* apple-script学习笔记
  这里存一个`hello-world'的例子：

  可以直接在命令行下执行
  #+BEGIN_SRC sh
    osascript -e 'display dialog "hello,world"'
  #+END_SRC

  写入脚本可以样写。
  #+BEGIN_SRC sh
    #!/bin/bash

    osascript - << END
    display dialog "hello,world"
    END
  #+END_SRC

  还可以直接把`display dialog "hello, world"'写入mac系统中默认的脚本编辑器中，就可以直接执行了。
* 键盘效率工具
** splotlight
   默认安装了的。使用`Ctrl+SPC'就可以调用出来。
** alfred
   配置得还不行。

   最后我直接购买了。使用非常不错。已经做为我很多东西的入口。切换程序也是用的它。

   使用 [[karabiner]] 来氢capslock设置成了f19。单独用来打开alfred。效果良好。 [[alfred-karabiner][这里]]

   在file search这个设置中的nivigation中将`use <enter> to open folder in Finder'打开。可以快速打开目录了。

*** Quicksilver
   一个类似于Alfred的软件但是是开源的而且可以自己写一些插件，使它更加的符合自己的习惯。还没有使用过。
** 资料
   [[http://wellsnake.com/jekyll/update/2014/06/15/001/][这里]] 有教程。

   [[http://www.zhihu.com/question/20656680][here]]

   [[https://github.com/zenorocha/alfred-workflows][workflow]]

   [[https://github.com/hzlzh/Best-App][best-app]]
