wiki/Mac-wiki.html

<div id="outline-container-org2708414" class="outline-3">
<h3 id="org2708414"><span class="section-number-3">1.41</span> 从源码编译emacs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
<div class="outline-text-3" id="text-1-41">
<p>
下载源码。
</p>

<p>
查看INSTALL。mac下需要查看netxstep/INSTALL。里面提示使用下面的命令：
</p>
<pre class="example">
     ./configure --with-ns
     make install
</pre>

<p>
第一个`&#x2013;with-ns'使emacs成为一个standalone的程序。
</p>

<p>
`make install'不会进行安装。这是在`nextstep/'下生成了一个Emacs.app。可以直接使用的。可以拷贝它到任何地方了。
</p>

<p>
在mac上编译emacs只能说是简单得令人发紫。只依赖`autoconf,automake'这些，而这些工具在安装`xcode'的时候就已经安装上了。
</p>

<p>
另外，默认的`emacsclient'是针对mac中自代的emacs-22的。从源码编译后，在`bin'文件夹中会有`emacsclient'。自民做一个软链接就行罗。
</p>
</div>
</div>

<div id="outline-container-org6eccca0" class="outline-3">
<h3 id="org6eccca0"><span class="section-number-3">1.42</span> mac中的gdb</h3>
<div class="outline-text-3" id="text-1-42">
<p>
mac中使用lldb来代替了gdb。但是有时候还是需要使用gdb。可以使用Macport来安装。
</p>

<pre class="example">
     sudo port install gdb-apple
</pre>

<p>
然后可以使用`gdb-apple'来调试。但是使用mac默认的编译器编出来的，貌似只能使用lldb来调试了。使用`apple-gcc'编译的应该可以。不过我的apple-gcc没有下载下来，就没有尝试。
</p>
</div>
</div>

<div id="outline-container-orgba7ff34" class="outline-3">
<h3 id="orgba7ff34"><span class="section-number-3">1.43</span> 在mac中使用swift编程&#xa0;&#xa0;&#xa0;<span class="tag"><span class="swift">swift</span></span></h3>
<div class="outline-text-3" id="text-1-43">
<p>
可以在xcode中建立工程。但是我喜欢这种方法。可以使用terminal的方式。如下：
</p>

<p>
使用`xcrun swift'可以进行一个交互式的swift解释器，然后可以`println("Hello,world");'。
</p>

<p>
可以把`println("Hello,world")'写入一个文件`hello.swift'中，然后使用`scrun swift hello.swift'运行。
</p>

<p>
还可以把`hello,swift'写成一个脚本，在开关加入`/usr/bin/xcrun swift'。修改权限可以运行的。这里`xcrun'是通过`which'查出来的。
</p>

<p>
其实是可以直接使用`swift'命令的。这个的作用就和`xcrun swift'是一样的。
</p>

<p>
也有`swift'的编译器-&gt;`swiftc'。可以`swiftc hello.swift -o hello'编译出来执行。（默认编译出来就是hello，使用`-o'选项可以控制下）。
</p>
</div>
</div>
<div id="outline-container-org5757450" class="outline-3">
<h3 id="org5757450"><span class="section-number-3">1.44</span> <span class="done DONE">DONE</span> 对ntfs的磁盘只读</h3>
<div class="outline-text-3" id="text-1-44">
<p>
可以使用`mount<sub>ntfs</sub>'命令来做。我不知道这个命令是mac自带的还是我下载了什么`ntfs*'软件给我的。
</p>

<p>
可以使用`diskutil info'已挂载的磁盘的信息。比如我就用`diskutil info /Volumes/win7'。查出来我的是`/dev/disk3s2'。
</p>

<p>
使用`diskutil eject /dev/disk3s2'来先推出。使用只有一个分驱的u盘时
不能用eject推出了，推出就找不到了磁盘了。需要使用`diskutil umount
/dev/disk3s2'卸载。
</p>

<p>
然后使用`sudo mount<sub>ntfs</sub> -o rw,nobrowse /dev/disk3s2 /tmp'将其挂载到`/tmp'下。现在就可读也可写了。
</p>

<p>
这个解决办法不是最理想的。可不可以有更好的？
</p>
</div>
</div>
<div id="outline-container-org9ebcfb5" class="outline-3">
<h3 id="org9ebcfb5"><span class="section-number-3">1.45</span> macbook合住盖子而不进入待机</h3>
<div class="outline-text-3" id="text-1-45">
<p>
InsomniaX 一个插件可以做到
</p>
</div>
</div>
<div id="outline-container-orga4b905f" class="outline-3">
<h3 id="orga4b905f"><span class="section-number-3">1.46</span> 录制Gif图片</h3>
<div class="outline-text-3" id="text-1-46">
<p>
licecap录制gif图片，很方便。
</p>
</div>
</div>
<div id="outline-container-orgdb7dc0f" class="outline-3">
<h3 id="orgdb7dc0f"><span class="section-number-3">1.47</span> cdto</h3>
<div class="outline-text-3" id="text-1-47">
<p>
可以在finder中添加一个icon，实现在当前文件夹中打开iTerm2或者terminal的功能。
</p>
</div>
</div>

<div id="outline-container-org0696603" class="outline-3">
<h3 id="org0696603"><span class="section-number-3">1.48</span> just focus 番茄工作法加定时锁屏，常用软件</h3>
</div>
<div id="outline-container-org4def101" class="outline-3">
<h3 id="org4def101"><span class="section-number-3">1.49</span> <span class="todo TODO">TODO</span> 待办</h3>
<div class="outline-text-3" id="text-1-49">
</div>
<div id="outline-container-org9bf74fe" class="outline-4">
<h4 id="org9bf74fe"><span class="section-number-4">1.49.1</span> <span class="todo TODO">TODO</span> 从源码安装了wget后，从bash中启动emacs可以找到，但是从launchpad中启动还是提示找不到wget</h4>
</div>

<div id="outline-container-org8846c8f" class="outline-4">
<h4 id="org8846c8f"><span class="section-number-4">1.49.2</span> <span class="todo TODO">TODO</span> 查字典</h4>
<div class="outline-text-4" id="text-1-49-2">
<p>
sdcv在brew中直接就有。可以直接安装。安装过程中还安装了依赖cmake。
</p>
</div>
</div>
<div id="outline-container-org5af00b3" class="outline-4">
<h4 id="org5af00b3"><span class="section-number-4">1.49.3</span> <span class="todo TODO">TODO</span> 通过zip安装的软件</h4>
<div class="outline-text-4" id="text-1-49-3">
<p>
从zip解压直接点击用的，还不知道怎么完全弄到电脑上来用。iterm2,opera都是这样的。
</p>
</div>
</div>
<div id="outline-container-org6675c6c" class="outline-4">
<h4 id="org6675c6c"><span class="section-number-4">1.49.4</span> <span class="todo TODO">TODO</span> 不断网锁屏</h4>
</div>
<div id="outline-container-orgbf52a87" class="outline-4">
<h4 id="orgbf52a87"><span class="section-number-4">1.49.5</span> <span class="todo TODO">TODO</span> 连接各种外设</h4>
</div>
<div id="outline-container-org257d99a" class="outline-4">
<h4 id="org257d99a"><span class="section-number-4">1.49.6</span> <span class="todo TODO">TODO</span> microsoft-office使用brew没有下载下来。不行不装了。就用iwork。</h4>
</div>
<div id="outline-container-orgc2740e1" class="outline-4">
<h4 id="orgc2740e1"><span class="section-number-4">1.49.7</span> <span class="todo TODO">TODO</span> 禁用触摸板</h4>
<div class="outline-text-4" id="text-1-49-7">
<p>
我发现如果手掌放到触摸板上鼠标是不会动的。苹果设计的很好哦。
</p>
</div>
</div>
<div id="outline-container-orgf3862ab" class="outline-4">
<h4 id="orgf3862ab"><span class="section-number-4">1.49.8</span> <span class="todo TODO">TODO</span> 把下载中的内容归类。软件这些都保存起来。</h4>
</div>
<div id="outline-container-org9c0470e" class="outline-4">
<h4 id="org9c0470e"><span class="section-number-4">1.49.9</span> <span class="todo TODO">TODO</span> finder中使用`/'来进入某一文件夹</h4>
<div class="outline-text-4" id="text-1-49-9">
<p>
默认是使用`shift+command+G'。我觉得很不方便。但是没有找到合适的办法。
</p>
</div>
</div>
<div id="outline-container-org26000ee" class="outline-4">
<h4 id="org26000ee"><span class="section-number-4">1.49.10</span> <span class="todo TODO">TODO</span> mou可以用来写markdown</h4>
<div class="outline-text-4" id="text-1-49-10">
<p>
不过没有使用过。
</p>
</div>
</div>
<div id="outline-container-orgef087c5" class="outline-4">
<h4 id="orgef087c5"><span class="section-number-4">1.49.11</span> <span class="todo TODO">TODO</span> jitouch功能更强大的多点触控软件</h4>
<div class="outline-text-4" id="text-1-49-11">
<p>
没有使用；
</p>
</div>
</div>
<div id="outline-container-orgcb99f3f" class="outline-4">
<h4 id="orgcb99f3f"><span class="section-number-4">1.49.12</span> <span class="todo TODO">TODO</span> 不像linux一样可以使用fdisk直接对U盘这些进行分区</h4>
</div>
<div id="outline-container-org93ccbb7" class="outline-4">
<h4 id="org93ccbb7"><span class="section-number-4">1.49.13</span> <span class="todo TODO">TODO</span> 文档查看器</h4>
<div class="outline-text-4" id="text-1-49-13">
</div>
<ol class="org-ol">
<li><a id="orgfa3d7df"></a>dash<br />
<div class="outline-text-5" id="text-1-49-13-1">
<p>
收费，试用阶段。不付费每次打开会有8秒钟等待时间。
</p>
</div>
</li>

<li><a id="org1d1a6d4"></a><span class="todo TODO">TODO</span> zeal<br />
<div class="outline-text-5" id="text-1-49-13-2">
<ul class="org-ul">
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2015-02-18 三 01:06]</span></span></li>
</ul>
<p>
mac上默认没有。需要从源码中安装。还没有安装。
</p>

<p>
<a href="https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=2&amp;ved=0CCgQFjAB&amp;url=http%3A%2F%2Fwww.hjue.me%2Fpost%2FCompile-Zear-on-Mac-OS-X&amp;ei=dnPjVOrlFoKmoQSinYDQCw&amp;usg=AFQjCNGKoLPfKnDimO4sYw-Vah8dDCBBxg&amp;sig2=VSHZlix7MF17GAoD8ipORw&amp;bvm=bv.85970519,d.cGU&amp;cad=rjt">这里</a> 看到的。
</p>
</div>
</li>

<li><a id="orgf64dd02"></a><span class="todo TODO">TODO</span> emacs-dash？<br />
<div class="outline-text-5" id="text-1-49-13-3">
<p>
也有这样的功能？
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org0b293cd" class="outline-4">
<h4 id="org0b293cd"><span class="section-number-4">1.49.14</span> <span class="todo TODO">TODO</span> mount和route命令和linux上不同</h4>
</div>

<div id="outline-container-org5b8b23f" class="outline-4">
<h4 id="org5b8b23f"><span class="section-number-4">1.49.15</span> <span class="todo TODO">TODO</span> clamAV for mac</h4>
<div class="outline-text-4" id="text-1-49-15">
<p>
安装好了但是还没有配置。
</p>
</div>
</div>
<div id="outline-container-org0386b9e" class="outline-4">
<h4 id="org0386b9e"><span class="section-number-4">1.49.16</span> <span class="todo TODO">TODO</span> jabref</h4>
<div class="outline-text-4" id="text-1-49-16">
<p>
可不可以直接从chrome中使用jabref打开就直接导入进去了。这样很方便？
</p>
</div>
</div>
<div id="outline-container-org84d817a" class="outline-4">
<h4 id="org84d817a"><span class="section-number-4">1.49.17</span> <span class="todo TODO">TODO</span> wireshark</h4>
<div class="outline-text-4" id="text-1-49-17">
<p>
通过brew cask安装好了。但是每次都要问X11安装在哪儿了。找到了又不能点击。
</p>
</div>
</div>
<div id="outline-container-org44ea9d1" class="outline-4">
<h4 id="org44ea9d1"><span class="section-number-4">1.49.18</span> <span class="todo TODO">TODO</span> 不从terminal启动emacs，则一些环境变量没有设置正确</h4>
</div>
</div>

<div id="outline-container-org402d0c3" class="outline-3">
<h3 id="org402d0c3"><span class="section-number-3">1.50</span> calibre管理书籍</h3>
<div class="outline-text-3" id="text-1-50">
<p>
使用 <code>calibre</code> 。可以导出epub拱ibooks使用。
</p>
</div>
</div>
</div>
<div id="outline-container-orgc6af8f7" class="outline-2">
<h2 id="orgc6af8f7"><span class="section-number-2">2</span> apple-script学习笔记</h2>
<div class="outline-text-2" id="text-2">
<p>
这里存一个`hello-world'的例子：
</p>

<p>
可以直接在命令行下执行
</p>
<div class="org-src-container">
<pre class="src src-sh">    osascript -e <span style="color: #ffa500;">'display dialog "hello,world"'</span>
</pre>
</div>

<p>
写入脚本可以样写。
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #cd5c5c;">#</span><span style="color: #cd5c5c;">!/bin/bash</span>

    osascript - &lt;&lt; END
<span style="color: #ffff00; font-weight: bold;">    display dialog "hello,world"</span>
<span style="color: #ffff00; font-weight: bold;">    END</span>
</pre>
</div>

<p>
还可以直接把`display dialog "hello, world"'写入mac系统中默认的脚本编辑器中，就可以直接执行了。
</p>
</div>
</div>
<div id="outline-container-org6393e1a" class="outline-2">
<h2 id="org6393e1a"><span class="section-number-2">3</span> 键盘效率工具</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3e06294" class="outline-3">
<h3 id="org3e06294"><span class="section-number-3">3.1</span> splotlight</h3>
<div class="outline-text-3" id="text-3-1">
<p>
默认安装了的。使用`Ctrl+SPC'就可以调用出来。
</p>
</div>
</div>
<div id="outline-container-org65d7b1d" class="outline-3">
<h3 id="org65d7b1d"><span class="section-number-3">3.2</span> alfred</h3>
<div class="outline-text-3" id="text-3-2">
<p>
配置得还不行。
</p>

<p>
最后我直接购买了。使用非常不错。已经做为我很多东西的入口。切换程序也是用的它。
</p>

<p>
使用 <a href="#orgcb2327d">1.33.1</a> 来氢capslock设置成了f19。单独用来打开alfred。效果良好。 <a href="#org72dcaeb">这里</a>
</p>

<p>
在file search这个设置中的nivigation中将`use &lt;enter&gt; to open folder in Finder'打开。可以快速打开目录了。
</p>
</div>

<div id="outline-container-org089828b" class="outline-4">
<h4 id="org089828b"><span class="section-number-4">3.2.1</span> Quicksilver</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
一个类似于Alfred的软件但是是开源的而且可以自己写一些插件，使它更加的符合自己的习惯。还没有使用过。
</p>
</div>
</div>
</div>
