wiki/Mac-wiki.org
** 我的配置过程
   可以设置search scope。我直接点了一下reset就把brew这些安装的程序路径自动设定好了。
