wiki/Mac-wiki.html
<div id="outline-container-org2c80d4a" class="outline-3">
<h3 id="org2c80d4a"><span class="section-number-3">3.3</span> 资料</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<a href="http://wellsnake.com/jekyll/update/2014/06/15/001/">这里</a> 有教程。
</p>

<p>
<a href="http://www.zhihu.com/question/20656680">here</a>
</p>

<p>
<a href="https://github.com/zenorocha/alfred-workflows">workflow</a>
</p>

<p>
<a href="https://github.com/hzlzh/Best-App">best-app</a>
</p>
</div>
</div>
<div id="outline-container-org5b95c1b" class="outline-3">
<h3 id="org5b95c1b"><span class="section-number-3">3.4</span> 我的配置过程</h3>
<div class="outline-text-3" id="text-3-4">
<p>
可以设置search scope。我直接点了一下reset就把brew这些安装的程序路径自动设定好了。
</p>
</div>
</div>
