wiki/Mac-wiki.org
** karabiner配置
   打开 =Misc & uninstall= ， =Open private.xml= ，然后把下面的内容写入
   就可以了。下面这个是教程上写的。启动或切换其它应该程序照着写就可以了。
   #+BEGIN_EXAMPLE
     <?xml version="1.0"?>
     <root>
       <!-- generic URL -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_WEB_karabiner</name>
         <url>https://pqrs.org/osx/karabiner/</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Calculator</name>
         <url type="file">/Applications/Calculator.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Emacs</name>
         <url type="file">/Applications/Emacs.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_iTerm2</name>
         <url type="file">/Users/pengpengxp/Application/iTerm.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Chrome</name>
         <url type="file">/Applications/Google Chrome.app</url>
       </vkopenurldef>

       <!-- shell commands -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_SHELL_date_pbcopy</name>
         <url type="shell">
           <![CDATA[    /bin/date | /usr/bin/pbcopy    ]]>
         </url>
       </vkopenurldef>

       <item>
         <name>Change right-command + w to open https://pqrs.org/osx/karabiner/</name>
         <identifier>private.right_command_w</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::W, ModifierFlag::COMMAND_R,
           KeyCode::VK_OPEN_URL_WEB_karabiner,
         </autogen>
       </item>

       <item>
         <name>Change right-command +left-command + c to launch calculator</name>
         <identifier>private.right_left_command_c</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::C, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Calculator,
         </autogen>
       </item>

       <item>
         <name>Change right-command + left-command + e to launch Emacs</name>
         <identifier>private.right_left_command_e</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::E, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Emacs,
         </autogen>
       </item>

       <item>
         <name>Change right-command + left-command + i to launch iTerm2</name>
         <identifier>private.right_left_command_i</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::I, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
         </autogen>
       </item>
       <item>
         <name>Change right-command + left-command + k to launch Chrome</name>
         <identifier>private.right_left_command_k</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::K, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Chrome,
         </autogen>
       </item>

       <item>
         <name>Change right-command + d to execute /bin/date | /usr/bin/pbcopy</name>
         <identifier>private.right_command_d</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::D, ModifierFlag::COMMAND_R,
           KeyCode::VK_OPEN_URL_SHELL_date_pbcopy,
         </autogen>
       </item>
     </root>
   #+END_EXAMPLE

   使用 launch mode v2可以达到更好的效果，下面把它原始的xml搞到下面：
   #+BEGIN_SRC xml
     <?xml version="1.0"?>
     <root>
       <item>
         <name>Launcher Mode</name>

         <item>
           <name>Launcher Mode v2</name>
           <appendix>Open apps by shortcut keys.</appendix>
           <appendix></appendix>
           <appendix>Usage:</appendix>
           <appendix></appendix>
           <appendix>Enable launcher mode by O key. (Remember as "O"pen apps.)</appendix>
           <appendix><![CDATA[  * Open "Activity Monitor" by "O down -> A down -> A up".  ]]></appendix>
           <appendix><![CDATA[  * Open "Mail" by "O down -> M down -> M up".  ]]></appendix>
           <appendix>And you can open other apps by similar way.</appendix>
           <appendix></appendix>
           <appendix>You can also open apps by holding O+A keys down.</appendix>
           <appendix>(You can adjust timeout by "__BlockUntilKeyUp__ Timeout" in Parameters tab.</appendix>
           <appendix></appendix>
           <appendix>List:</appendix>
           <appendix></appendix>
           <appendix>* Activity Monitor: O+A key</appendix>
           <appendix>* Search a selected text by Dictionary: O+Q key</appendix>
           <appendix>* Dictionary: O+Q,Q (press Q twice)</appendix>
           <appendix>* Show desktop: O+D key</appendix>
           <appendix>* DigitalColor Meter: O+D,D (press D twice)</appendix>
           <appendix>* Launchpad: O+Space key</appendix>
           <appendix>* Mail: O+M key</appendix>
           <appendix>* Mission Control: O+Tab key</appendix>
           <appendix>* Finder: O+F key</appendix>
           <appendix>* Open Desktop by Finder: O+F,D key</appendix>
           <appendix>* Open the home folder by Finder: O+F,F (press F twice)</appendix>
           <appendix>* Safari: O+S key</appendix>
           <appendix>* Stickies: O+S,S (press S twice)</appendix>
           <appendix>* Terminal: O+T key</appendix>
           <appendix>* TextEdit: O+E key</appendix>
           <appendix>* Xcode: O+X key</appendix>
           <appendix>* iPhone Simulator: O+X,X (press X twice)</appendix>

           <identifier>remap.launcher_mode_v2</identifier>

           {{ LAUNCHER_MODE_V2_CONDITION }}

           <autogen>
             __KeyOverlaidModifier__
             {{ LAUNCHER_MODE_V2_KEY }},

             <!--
                 Use notsave.launcher_mode_v2 in order to be higher priority.
                 Use ModifierFlag::LAUNCHER_MODE_V2 for __DropAllKeys__.
             -->
             @begin
             KeyCode::VK_CONFIG_SYNC_KEYDOWNUP_notsave_launcher_mode_v2, ModifierFlag::LAUNCHER_MODE_V2,
             @end

             @begin
             {{ LAUNCHER_MODE_V2_KEY }},
             @end
           </autogen>
         </item>

         <item hidden="true">
           <identifier vk_config="true">notsave.launcher_mode_v2</identifier>

           {{ LAUNCHER_MODE_V2_EXTRA }}

           <autogen>
             __BlockUntilKeyUp__ {{ LAUNCHER_MODE_V2_KEY }}
           </autogen>

           <autogen>__KeyDownUpToKey__ KeyCode::A, KeyCode::VK_OPEN_URL_APP_Activity_Monitor</autogen>
           <autogen>
             __KeyToKey__
             KeyCode::Q,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::C, ModifierFlag::COMMAND_L,
             KeyCode::VK_WAIT_100MS,
             KeyCode::VK_OPEN_URL_APP_Dictionary,
             KeyCode::VK_WAIT_100MS,
             KeyCode::VK_WAIT_100MS,
             KeyCode::V, ModifierFlag::COMMAND_L,
             KeyCode::A, ModifierFlag::COMMAND_L,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::Q,
             KeyCode::VK_OPEN_URL_APP_Dictionary,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           </autogen>
           <autogen>
             __KeyToKey__
             KeyCode::D,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::MISSION_CONTROL, ModifierFlag::COMMAND_L,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::D,
             KeyCode::VK_OPEN_URL_APP_DigitalColor_Meter,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           </autogen>
           <autogen>__KeyDownUpToKey__ KeyCode::SPACE, KeyCode::VK_OPEN_URL_APP_Launchpad</autogen>
           <autogen>__KeyDownUpToKey__ KeyCode::M, KeyCode::VK_OPEN_URL_APP_Mail</autogen>
           <autogen>__KeyDownUpToKey__ KeyCode::TAB, KeyCode::VK_OPEN_URL_APP_Mission_Control</autogen>
           <autogen>
             __KeyToKey__
             KeyCode::F,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::VK_OPEN_URL_APP_Finder,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::D,
             KeyCode::VK_OPEN_URL_FILE_Desktop,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::F,
             KeyCode::VK_OPEN_URL_FILE_Home,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           </autogen>
           <autogen>
             __KeyToKey__
             KeyCode::S,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::VK_OPEN_URL_APP_Safari,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::S,
             KeyCode::VK_OPEN_URL_APP_Stickies,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           </autogen>
           <autogen>__KeyDownUpToKey__ KeyCode::T, KeyCode::VK_OPEN_URL_APP_Terminal</autogen>
           <autogen>__KeyDownUpToKey__ KeyCode::E, KeyCode::VK_OPEN_URL_APP_TextEdit</autogen>
           <autogen>
             __KeyToKey__
             KeyCode::X,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::VK_OPEN_URL_APP_Xcode,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::X,
             KeyCode::VK_OPEN_URL_APP_iPhoneSimulator,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           </autogen>

           <autogen>
             __DropAllKeys__
             ModifierFlag::LAUNCHER_MODE_V2,

             Option::DROPALLKEYS_DROP_KEY,
           </autogen>
         </item>

       </item>
     </root>
   #+END_SRC

   保存一下我自己的private.xml：
   #+BEGIN_SRC xml
     <?xml version="1.0"?>
     <root>

       <item>
         <name>disable command + h</name>
         <identifier>private.disable_command_h</identifier>
         <autogen>__KeyToKey__ KeyCode::H, VK_COMMAND | ModifierFlag::NONE, KeyCode::VK_NONE</autogen>
       </item>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_SHELL_switchprofile_space</name>
         <url type="shell">
           <![CDATA[    /Applications/Karabiner.app/Contents/Library/bin/karabiner select_by_name space ]]>
         </url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_SHELL_switchprofile_nospace</name>
         <url type="shell">
           <![CDATA[    /Applications/Karabiner.app/Contents/Library/bin/karabiner select_by_name nospace ]]>
         </url>
       </vkopenurldef>

       <item>
         <name>Switch Profile to space with lcommand + rcommand + 1</name>
         <identifier>private.switchspace</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::1, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_SHELL_switchprofile_space
         </autogen>
       </item>

       <item>
         <name>Switch Profile to nospace with lcommand + rcommand + 2</name>
         <identifier>private.switchnospace</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::2, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_SHELL_switchprofile_nospace
         </autogen>
       </item>

       <!-- generic URL -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_WEB_karabiner</name>
         <url>https://pqrs.org/osx/karabiner/</url>
       </vkopenurldef>

       <!-- shell commands -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_SHELL_date_pbcopy</name>
         <url type="shell">
           <![CDATA[    /bin/date | /usr/bin/pbcopy    ]]>
         </url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Firefox</name>
         <url type="file">/Applications/Firefox.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Postman</name>
         <url type="file">/Applications/Postman.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Finder</name>
         <url type="file">/Users/pengpengxp</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Pycharm</name>
         <url type="file">/Applications/PyCharm CE.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Dash</name>
         <url type="file">/Applications/Dash.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_DoubleCommander</name>
         <url type="file">/Applications/Double Commander.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Foxmail</name>
         <url type="file">/Applications/Foxmail.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Newton</name>
         <url type="file">/Applications/Newton.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Ibook</name>
         <url type="file">/Applications/iBooks.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Excel</name>
         <url type="file">/Applications/Microsoft Excel.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Xmind</name>
         <url type="file">/Applications/XMind.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Thunder</name>
         <url type="file">/Applications/Thunder.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Terminal</name>
         <url type="file">/Applications/Utilities/Terminal.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_QQ</name>
         <url type="file">/Applications/QQ.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Safari</name>
         <url type="file">/Applications/Safari.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Skim</name>
         <url type="file">/Applications/Skim.app</url>
       </vkopenurldef>

       <!-- for remote terminal -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshcontroller</name>
         <url type="file">/Users/pengpengxp/bin/ssh/controller.command</url>
       </vkopenurldef>
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshobject1</name>
         <url type="file">/Users/pengpengxp/bin/ssh/object1.command</url>
       </vkopenurldef>
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshobject2</name>
         <url type="file">/Users/pengpengxp/bin/ssh/object2.command</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshb</name>
         <url type="file">/Users/pengpengxp/bin/ssh/b.command</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshop1</name>
         <url type="file">/Users/pengpengxp/bin/ssh/op1.command</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshop2</name>
         <url type="file">/Users/pengpengxp/bin/ssh/op2.command</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshop3</name>
         <url type="file">/Users/pengpengxp/bin/ssh/op3.command</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshop4</name>
         <url type="file">/Users/pengpengxp/bin/ssh/op4.command</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshpt</name>
         <url type="file">/Users/pengpengxp/bin/ssh/pt.command</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sshup</name>
         <url type="file">/Users/pengpengxp/bin/ssh/up.command</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Qianniu</name>
         <url type="file">/Applications/AliWorkBench.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Wireshark</name>
         <url type="file">/Applications/Wireshark.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Map</name>
         <url type="file">/Applications/Maps.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Ouludict</name>
         <url type="file">/Applications/Eudb_en_free.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_WangyiMusic</name>
         <url type="file">/Applications/NeteaseMusic.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Sublime</name>
         <url type="file">/Applications/Sublime Text.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Calendar</name>
         <url type="file">/Applications/Calendar.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_BeyondCompare</name>
         <url type="file">/Applications/Beyond Compare.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Preview</name>
         <url type="file">/Applications/Preview.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Numbers</name>
         <url type="file">/Applications/Numbers.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_VirtualBox</name>
         <url type="file">/Applications/VirtualBox.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_karabiner</name>
         <url type="file">/Applications/Karabiner.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Maps</name>
         <url type="file">/Applications/Maps.app</url>
       </vkopenurldef>

       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_FaceTime</name>
         <url type="file">/Applications/FaceTime.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Calculator</name>
         <url type="file">/Applications/Calculator.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Emacs25mac</name>
         <url type="file">/Applications/Emacs.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Opera</name>
         <url type="file">/Applications/Opera.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_iTerm2</name>
         <url type="file">/Applications/iTerm.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_weChat</name>
         <url type="file">/Applications/WeChat.app</url>
       </vkopenurldef>

       <!-- file path -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_APP_Chrome</name>
         <url type="file">/Applications/Google Chrome.app</url>
       </vkopenurldef>

       <item>
         <name>Change right-command + w to open https://pqrs.org/osx/karabiner/</name>
         <identifier>private.right_command_w</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::W, ModifierFlag::COMMAND_R,
           KeyCode::VK_OPEN_URL_WEB_karabiner,
         </autogen>
       </item>

       <!-- <item> -->
       <!--   <name>Change right-command +left-command + c to launch calculator</name> -->
       <!--   <identifier>private.right_left_command_c</identifier> -->
       <!--   <autogen> -->
       <!--     __KeyToKey__ -->
       <!--     KeyCode::C, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L, -->
       <!--     KeyCode::VK_OPEN_URL_APP_Calculator, -->
       <!--   </autogen> -->
       <!-- </item> -->

       <item>
         <name>Change right-command +left-command + m to launch Foxmail</name>
         <identifier>private.right_left_command_m</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::M, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Newton,
         </autogen>
       </item>

       <item>
         <name>Change right-command +left-command + l to launch virtualbox</name>
         <identifier>private.right_left_command_l</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::L, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_VirtualBox,
         </autogen>
       </item>

       <item>
         <name>Change right-command +left-command + v to launch virtualbox</name>
         <identifier>private.right_left_command_v</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::V, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_VirtualBox,
         </autogen>
       </item>

       <item>
         <!-- <name>Change right-command +left-command + f to launch DoubleCommander</name> -->
         <name>Change right-command +left-command + f to launch Finder</name>
         <identifier>private.right_left_command_f</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::F, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Finder,
           <!-- KeyCode::VK_OPEN_URL_APP_DoubleCommander, -->
         </autogen>
       </item>

       <item>
         <name>Change right-command +left-command + x to launch Xmind</name>
         <identifier>private.right_left_command_x</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::X, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Xmind,
         </autogen>
       </item>

       <item>
         <name>Change right-command +left-command + s to launch Firefox</name>
         <identifier>private.right_left_command_s</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::S, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Firefox,
         </autogen>
       </item>

       <item>
         <name>Change right-command +left-command + RETURN to launch iTerm2 and Emacs</name>
         <identifier>private.right_left_command_return</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::RETURN, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
           KeyCode::VK_OPEN_URL_APP_Emacs25mac,
         </autogen>
       </item>

       <item>
         <name>Change right-command +left-command + DELETE to launch iTerm2 and Chrome</name>
         <identifier>private.right_left_command_delete</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::DELETE, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
           KeyCode::VK_OPEN_URL_APP_Chrome,
         </autogen>
       </item>

       <item>
         <name>Change right-command +left-command + k to launch karabiner</name>
         <identifier>private.right_left_command_k</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::K, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_karabiner,
         </autogen>
       </item>

       <item>
         <name>Change right-command + left-command + e to launch Emacs</name>
         <identifier>private.right_left_command_e</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::E, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Emacs25mac,
         </autogen>
       </item>

       <item>
         <name>Change right-command + left-command + j to launch iTerm2 and Emacs</name>
         <identifier>private.right_left_command_j</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::J, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
           KeyCode::VK_OPEN_URL_APP_Emacs25mac,
         </autogen>
       </item>

       <item>
         <name>Change right-command + left-command + r to launch wireshark</name>
         <identifier>private.right_left_command_r</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::R, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Wireshark,
         </autogen>
       </item>

       <item>
         <name>Change right-command + left-command + c to launch iTerm2 and Chrome</name>
         <identifier>private.right_left_command_c</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::C, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
           KeyCode::VK_OPEN_URL_APP_Chrome,
         </autogen>
       </item>

       <item>
         <name>Change right-command + left-command + w to launch weChat</name>
         <identifier>private.right_left_command_w</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::W, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_weChat,
         </autogen>
       </item>

       <item>
         <name>Change right-command + left-command + i to launch iTerm2</name>
         <identifier>private.right_left_command_i</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::I, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
         </autogen>
       </item>
       <item>
         <name>Change right-command + left-command + g to launch Chrome</name>
         <identifier>private.right_left_command_g</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::G, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Chrome,
         </autogen>
       </item>

       <item>
         <name>Change right-command + d to execute /bin/date | /usr/bin/pbcopy</name>
         <identifier>private.right_command_d</identifier>
         <autogen>
           __KeyToKey__
           KeyCode::D, ModifierFlag::COMMAND_R,
           KeyCode::VK_OPEN_URL_SHELL_date_pbcopy,
         </autogen>
       </item>

       <!-- for virtualbox -->
       <item>
         <name>Pengpengxp's irtualBox</name>

         <item>
           <name>Change Command_L to Control_L</name>
           <identifier>remap.app_vm_commandL2controlL</identifier>
           <only>VIRTUALMACHINE</only>
           <autogen>__KeyToKey__ KeyCode::COMMAND_L, KeyCode::CONTROL_L</autogen>
         </item>

       </item>

       <!-- use launch mode v2 to switch app -->
       <!-- for finder -->
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_FILE_Src</name>
         <url type="file">/Users/pengpengxp/src</url>
       </vkopenurldef>
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_FILE_Tmp</name>
         <url type="file">/tmp</url>
       </vkopenurldef>
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_FILE_Documents</name>
         <url type="file">/Users/pengpengxp/Documents</url>
       </vkopenurldef>
       <vkopenurldef>
         <name>KeyCode::VK_OPEN_URL_FILE_Downloads</name>
         <url type="file">/Users/pengpengxp/Downloads</url>
       </vkopenurldef>

     <!-- use launch mode v2 to switch app -->
       <!-- switch prefixkeys -->
       <replacementdef>
         <replacementname>LAUNCHER_MODE_V2_KEY</replacementname>
         <replacementvalue>KeyCode::SPACE</replacementvalue>
         <!-- <replacementvalue>KeyCode::F19</replacementvalue> -->
       </replacementdef>

       <replacementdef>

         <replacementname>LAUNCHER_MODE_V2_EXTRA</replacementname>
         <replacementvalue>
           <![CDATA[
             <autogen>
               __KeyDownUpToKey__
               KeyCode::E,
               KeyCode::VK_OPEN_URL_APP_Emacs25mac,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::P,
               KeyCode::VK_OPEN_URL_APP_Postman,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::RETURN,
               KeyCode::VK_OPEN_URL_APP_iTerm2,
               KeyCode::VK_OPEN_URL_APP_Emacs25mac,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::DELETE,
               KeyCode::VK_OPEN_URL_APP_iTerm2,
               KeyCode::VK_OPEN_URL_APP_Chrome,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::I,
               KeyCode::VK_OPEN_URL_APP_iTerm2,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::G,
               KeyCode::VK_OPEN_URL_APP_Chrome,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::V,
               KeyCode::VK_OPEN_URL_APP_VirtualBox,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::K,
               KeyCode::VK_OPEN_URL_APP_karabiner,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::U,
               KeyCode::VK_OPEN_URL_APP_Excel,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::W,
               KeyCode::VK_OPEN_URL_APP_weChat,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::N,
               KeyCode::VK_OPEN_URL_APP_Excel,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::B,
               KeyCode::VK_OPEN_URL_APP_BeyondCompare,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::C,
               KeyCode::VK_OPEN_URL_APP_iTerm2,
               KeyCode::VK_OPEN_URL_APP_Chrome,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::L,
               KeyCode::VK_OPEN_URL_APP_VirtualBox,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::J,
               KeyCode::VK_OPEN_URL_APP_iTerm2,
               KeyCode::VK_OPEN_URL_APP_Emacs25mac,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::X,
               KeyCode::VK_OPEN_URL_APP_Xmind,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::R,
               KeyCode::VK_OPEN_URL_APP_Wireshark,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::M,
               KeyCode::VK_OPEN_URL_APP_Newton,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::F1,
               KeyCode::VK_OPEN_URL_APP_WangyiMusic,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::F2,
               KeyCode::VK_OPEN_URL_APP_Map,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::F3,
               KeyCode::VK_OPEN_URL_APP_Ouludict,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::S,
               KeyCode::VK_OPEN_URL_APP_Opera,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::D,
               KeyCode::VK_OPEN_URL_APP_Safari,
             </autogen>
     <!-- O for open external program -->
           <autogen>
             __KeyToKey__
             KeyCode::O,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::W,
             KeyCode::VK_OPEN_URL_APP_WangyiMusic,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::N,
             KeyCode::VK_OPEN_URL_APP_Qianniu,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::O,
             KeyCode::VK_OPEN_URL_APP_Ouludict,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::M,
             KeyCode::VK_OPEN_URL_APP_Map,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::C,
             KeyCode::VK_OPEN_URL_APP_Calendar,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::Q,
             KeyCode::VK_OPEN_URL_APP_QQ,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::X,
             KeyCode::VK_OPEN_URL_APP_Thunder,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::J,
             KeyCode::VK_OPEN_URL_APP_Calculator,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::K,
             KeyCode::VK_OPEN_URL_APP_Skim,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::I,
             KeyCode::VK_OPEN_URL_APP_Ibook,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::D,
             KeyCode::VK_OPEN_URL_APP_Dash,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::P,
             KeyCode::VK_OPEN_URL_APP_Pycharm,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

           </autogen>

     <!-- H for terminal -->
           <autogen>
             __KeyToKey__
             KeyCode::H,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::VK_OPEN_URL_APP_Terminal,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::T,
             KeyCode::VK_OPEN_URL_APP_Sshpt,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::U,
             KeyCode::VK_OPEN_URL_APP_Sshup,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::O,
             KeyCode::VK_OPEN_URL_APP_Sshop1,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::1,
             KeyCode::VK_OPEN_URL_APP_Sshop1,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::2,
             KeyCode::VK_OPEN_URL_APP_Sshop2,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::3,
             KeyCode::VK_OPEN_URL_APP_Sshop3,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::4,
             KeyCode::VK_OPEN_URL_APP_Sshop4,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::B,
             KeyCode::VK_OPEN_URL_APP_Sshb,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           </autogen>

     <!-- numbers for openstack remote terminal -->
             <autogen>
               __KeyDownUpToKey__
               KeyCode::1,
               KeyCode::VK_OPEN_URL_APP_Sshop1,
             </autogen>
             <autogen>
               __KeyDownUpToKey__
               KeyCode::2,
               KeyCode::VK_OPEN_URL_APP_Sshop2,
             </autogen>
             <autogen>
               __KeyDownUpToKey__
               KeyCode::3,
               KeyCode::VK_OPEN_URL_APP_Sshop3,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::4,
               KeyCode::VK_OPEN_URL_APP_Sshcontroller,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::5,
               KeyCode::VK_OPEN_URL_APP_Sshobject1,
             </autogen>

             <autogen>
               __KeyDownUpToKey__
               KeyCode::6,
               KeyCode::VK_OPEN_URL_APP_Sshobject2,
             </autogen>

     <!-- F for finder -->
             <autogen>
             __KeyToKey__
             KeyCode::F,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             <!-- KeyCode::VK_OPEN_URL_APP_Finder, -->
             KeyCode::VK_OPEN_URL_APP_Finder,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::D,
             KeyCode::VK_OPEN_URL_FILE_Desktop,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::F,
             KeyCode::VK_OPEN_URL_FILE_Home,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::S,
             KeyCode::VK_OPEN_URL_FILE_Src,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::T,
             KeyCode::VK_OPEN_URL_FILE_Tmp,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::W,
             KeyCode::VK_OPEN_URL_FILE_Downloads,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::C,
             KeyCode::VK_OPEN_URL_FILE_Documents,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

           </autogen>
           ]]>
         </replacementvalue>

       </replacementdef>

     </root>
   #+END_SRC

   在virtualbox等虚拟中修改按键，下面这个可以把左command改为左control：
   #+BEGIN_SRC xml

       <!-- for virtualbox -->
       <item>
         <name>Pengpengxp's irtualBox</name>

         <item>
           <name>Change Command_L to Control_L</name>
           <identifier>remap.app_vm_commandL2controlL</identifier>
           <only>VIRTUALMACHINE</only>
           <autogen>__KeyToKey__ KeyCode::COMMAND_L, KeyCode::CONTROL_L</autogen>
         </item>

       </item>
   #+END_SRC

