wiki/Mac-wiki.html
<div id="outline-container-orgd4f7471" class="outline-3">
<h3 id="orgd4f7471"><span class="section-number-3">3.5</span> karabiner配置</h3>
<div class="outline-text-3" id="text-3-5">
<p>
打开 <code>Misc &amp; uninstall</code> ， <code>Open private.xml</code> ，然后把下面的内容写入
就可以了。下面这个是教程上写的。启动或切换其它应该程序照着写就可以了。
</p>
<pre class="example">
     &lt;?xml version="1.0"?&gt;
     &lt;root&gt;
       &lt;!-- generic URL --&gt;
       &lt;vkopenurldef&gt;
         &lt;name&gt;KeyCode::VK_OPEN_URL_WEB_karabiner&lt;/name&gt;
         &lt;url&gt;https://pqrs.org/osx/karabiner/&lt;/url&gt;
       &lt;/vkopenurldef&gt;

       &lt;!-- file path --&gt;
       &lt;vkopenurldef&gt;
         &lt;name&gt;KeyCode::VK_OPEN_URL_APP_Calculator&lt;/name&gt;
         &lt;url type="file"&gt;/Applications/Calculator.app&lt;/url&gt;
       &lt;/vkopenurldef&gt;

       &lt;!-- file path --&gt;
       &lt;vkopenurldef&gt;
         &lt;name&gt;KeyCode::VK_OPEN_URL_APP_Emacs&lt;/name&gt;
         &lt;url type="file"&gt;/Applications/Emacs.app&lt;/url&gt;
       &lt;/vkopenurldef&gt;

       &lt;!-- file path --&gt;
       &lt;vkopenurldef&gt;
         &lt;name&gt;KeyCode::VK_OPEN_URL_APP_iTerm2&lt;/name&gt;
         &lt;url type="file"&gt;/Users/pengpengxp/Application/iTerm.app&lt;/url&gt;
       &lt;/vkopenurldef&gt;

       &lt;!-- file path --&gt;
       &lt;vkopenurldef&gt;
         &lt;name&gt;KeyCode::VK_OPEN_URL_APP_Chrome&lt;/name&gt;
         &lt;url type="file"&gt;/Applications/Google Chrome.app&lt;/url&gt;
       &lt;/vkopenurldef&gt;

       &lt;!-- shell commands --&gt;
       &lt;vkopenurldef&gt;
         &lt;name&gt;KeyCode::VK_OPEN_URL_SHELL_date_pbcopy&lt;/name&gt;
         &lt;url type="shell"&gt;
           &lt;![CDATA[    /bin/date | /usr/bin/pbcopy    ]]&gt;
         &lt;/url&gt;
       &lt;/vkopenurldef&gt;

       &lt;item&gt;
         &lt;name&gt;Change right-command + w to open https://pqrs.org/osx/karabiner/&lt;/name&gt;
         &lt;identifier&gt;private.right_command_w&lt;/identifier&gt;
         &lt;autogen&gt;
           __KeyToKey__
           KeyCode::W, ModifierFlag::COMMAND_R,
           KeyCode::VK_OPEN_URL_WEB_karabiner,
         &lt;/autogen&gt;
       &lt;/item&gt;

       &lt;item&gt;
         &lt;name&gt;Change right-command +left-command + c to launch calculator&lt;/name&gt;
         &lt;identifier&gt;private.right_left_command_c&lt;/identifier&gt;
         &lt;autogen&gt;
           __KeyToKey__
           KeyCode::C, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Calculator,
         &lt;/autogen&gt;
       &lt;/item&gt;

       &lt;item&gt;
         &lt;name&gt;Change right-command + left-command + e to launch Emacs&lt;/name&gt;
         &lt;identifier&gt;private.right_left_command_e&lt;/identifier&gt;
         &lt;autogen&gt;
           __KeyToKey__
           KeyCode::E, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Emacs,
         &lt;/autogen&gt;
       &lt;/item&gt;

       &lt;item&gt;
         &lt;name&gt;Change right-command + left-command + i to launch iTerm2&lt;/name&gt;
         &lt;identifier&gt;private.right_left_command_i&lt;/identifier&gt;
         &lt;autogen&gt;
           __KeyToKey__
           KeyCode::I, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
         &lt;/autogen&gt;
       &lt;/item&gt;
       &lt;item&gt;
         &lt;name&gt;Change right-command + left-command + k to launch Chrome&lt;/name&gt;
         &lt;identifier&gt;private.right_left_command_k&lt;/identifier&gt;
         &lt;autogen&gt;
           __KeyToKey__
           KeyCode::K, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Chrome,
         &lt;/autogen&gt;
       &lt;/item&gt;

       &lt;item&gt;
         &lt;name&gt;Change right-command + d to execute /bin/date | /usr/bin/pbcopy&lt;/name&gt;
         &lt;identifier&gt;private.right_command_d&lt;/identifier&gt;
         &lt;autogen&gt;
           __KeyToKey__
           KeyCode::D, ModifierFlag::COMMAND_R,
           KeyCode::VK_OPEN_URL_SHELL_date_pbcopy,
         &lt;/autogen&gt;
       &lt;/item&gt;
     &lt;/root&gt;
</pre>

<p>
使用 launch mode v2可以达到更好的效果，下面把它原始的xml搞到下面：
</p>
<div class="org-src-container">
<pre class="src src-xml">     <span style="color: #ffa500;">&lt;?</span><span style="color: PaleYellow;">xml</span><span style="color: #ffa500;"> </span><span style="color: #ffa500;">version="1.0"</span><span style="color: #ffa500;">?&gt;</span>
     &lt;<span style="color: #9acd32;">root</span>&gt;
       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Launcher Mode&lt;/<span style="color: #9acd32;">name</span>&gt;

         &lt;<span style="color: #9acd32;">item</span>&gt;
           &lt;<span style="color: #9acd32;">name</span>&gt;Launcher Mode v2&lt;/<span style="color: #9acd32;">name</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;Open apps by shortcut keys.&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;Usage:&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;Enable launcher mode by O key. (Remember as "O"pen apps.)&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;<span style="color: #ffa500;">&lt;![</span><span style="color: #b0c4de;">CDATA</span><span style="color: #ffa500;">[</span><span style="color: #ffa500;">  * Open "Activity Monitor" by "O down -&gt; A down -&gt; A up".  </span><span style="color: #ffa500;">]]&gt;</span>&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;<span style="color: #ffa500;">&lt;![</span><span style="color: #b0c4de;">CDATA</span><span style="color: #ffa500;">[</span><span style="color: #ffa500;">  * Open "Mail" by "O down -&gt; M down -&gt; M up".  </span><span style="color: #ffa500;">]]&gt;</span>&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;And you can open other apps by similar way.&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;You can also open apps by holding O+A keys down.&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;(You can adjust timeout by "__BlockUntilKeyUp__ Timeout" in Parameters tab.&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;List:&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Activity Monitor: O+A key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Search a selected text by Dictionary: O+Q key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Dictionary: O+Q,Q (press Q twice)&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Show desktop: O+D key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* DigitalColor Meter: O+D,D (press D twice)&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Launchpad: O+Space key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Mail: O+M key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Mission Control: O+Tab key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Finder: O+F key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Open Desktop by Finder: O+F,D key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Open the home folder by Finder: O+F,F (press F twice)&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Safari: O+S key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Stickies: O+S,S (press S twice)&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Terminal: O+T key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* TextEdit: O+E key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* Xcode: O+X key&lt;/<span style="color: #9acd32;">appendix</span>&gt;
           &lt;<span style="color: #9acd32;">appendix</span>&gt;* iPhone Simulator: O+X,X (press X twice)&lt;/<span style="color: #9acd32;">appendix</span>&gt;

           &lt;<span style="color: #9acd32;">identifier</span>&gt;remap.launcher_mode_v2&lt;/<span style="color: #9acd32;">identifier</span>&gt;

           {{ LAUNCHER_MODE_V2_CONDITION }}

           &lt;<span style="color: #9acd32;">autogen</span>&gt;
             __KeyOverlaidModifier__
             {{ LAUNCHER_MODE_V2_KEY }},

             <span style="color: #cd5c5c;">&lt;!--</span>
<span style="color: #cd5c5c;">                 </span><span style="color: #cd5c5c;">Use notsave.launcher_mode_v2 in order to be higher priority.</span>
<span style="color: #cd5c5c;">                 Use ModifierFlag::LAUNCHER_MODE_V2 for __DropAllKeys__.</span>
<span style="color: #cd5c5c;">             </span><span style="color: #cd5c5c;">--&gt;</span>
             @begin
             KeyCode::VK_CONFIG_SYNC_KEYDOWNUP_notsave_launcher_mode_v2, ModifierFlag::LAUNCHER_MODE_V2,
             @end

             @begin
             {{ LAUNCHER_MODE_V2_KEY }},
             @end
           &lt;/<span style="color: #9acd32;">autogen</span>&gt;
         &lt;/<span style="color: #9acd32;">item</span>&gt;

         &lt;<span style="color: #9acd32;">item</span> <span style="color: #8fbc8f;">hidden</span>=<span style="color: #ffa500;">"true"</span>&gt;
           &lt;<span style="color: #9acd32;">identifier</span> <span style="color: #8fbc8f;">vk_config</span>=<span style="color: #ffa500;">"true"</span>&gt;notsave.launcher_mode_v2&lt;/<span style="color: #9acd32;">identifier</span>&gt;

           {{ LAUNCHER_MODE_V2_EXTRA }}

           &lt;<span style="color: #9acd32;">autogen</span>&gt;
             __BlockUntilKeyUp__ {{ LAUNCHER_MODE_V2_KEY }}
           &lt;/<span style="color: #9acd32;">autogen</span>&gt;

           &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyDownUpToKey__ KeyCode::A, KeyCode::VK_OPEN_URL_APP_Activity_Monitor&lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;
             __KeyToKey__
             KeyCode::Q,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::C, ModifierFlag::COMMAND_L,
             KeyCode::VK_WAIT_100MS,
             KeyCode::VK_OPEN_URL_APP_Dictionary,
             KeyCode::VK_WAIT_100MS,
             KeyCode::VK_WAIT_100MS,
             KeyCode::V, ModifierFlag::COMMAND_L,
             KeyCode::A, ModifierFlag::COMMAND_L,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::Q,
             KeyCode::VK_OPEN_URL_APP_Dictionary,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           &lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;
             __KeyToKey__
             KeyCode::D,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::MISSION_CONTROL, ModifierFlag::COMMAND_L,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::D,
             KeyCode::VK_OPEN_URL_APP_DigitalColor_Meter,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           &lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyDownUpToKey__ KeyCode::SPACE, KeyCode::VK_OPEN_URL_APP_Launchpad&lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyDownUpToKey__ KeyCode::M, KeyCode::VK_OPEN_URL_APP_Mail&lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyDownUpToKey__ KeyCode::TAB, KeyCode::VK_OPEN_URL_APP_Mission_Control&lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;
             __KeyToKey__
             KeyCode::F,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::VK_OPEN_URL_APP_Finder,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::D,
             KeyCode::VK_OPEN_URL_FILE_Desktop,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::F,
             KeyCode::VK_OPEN_URL_FILE_Home,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           &lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;
             __KeyToKey__
             KeyCode::S,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::VK_OPEN_URL_APP_Safari,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::S,
             KeyCode::VK_OPEN_URL_APP_Stickies,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           &lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyDownUpToKey__ KeyCode::T, KeyCode::VK_OPEN_URL_APP_Terminal&lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyDownUpToKey__ KeyCode::E, KeyCode::VK_OPEN_URL_APP_TextEdit&lt;/<span style="color: #9acd32;">autogen</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;
             __KeyToKey__
             KeyCode::X,
             KeyCode::VK_NONE,

             Option::KEYTOKEY_DELAYED_ACTION,
             KeyCode::VK_OPEN_URL_APP_Xcode,

             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::X,
             KeyCode::VK_OPEN_URL_APP_iPhoneSimulator,
             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,
           &lt;/<span style="color: #9acd32;">autogen</span>&gt;

           &lt;<span style="color: #9acd32;">autogen</span>&gt;
             __DropAllKeys__
             ModifierFlag::LAUNCHER_MODE_V2,

             Option::DROPALLKEYS_DROP_KEY,
           &lt;/<span style="color: #9acd32;">autogen</span>&gt;
         &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;/<span style="color: #9acd32;">item</span>&gt;
     &lt;/<span style="color: #9acd32;">root</span>&gt;
</pre>
</div>

<p>
保存一下我自己的private.xml：
</p>
<div class="org-src-container">
<pre class="src src-xml">     <span style="color: #ffa500;">&lt;?</span><span style="color: PaleYellow;">xml</span><span style="color: #ffa500;"> </span><span style="color: #ffa500;">version="1.0"</span><span style="color: #ffa500;">?&gt;</span>
     &lt;<span style="color: #9acd32;">root</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;disable command + h&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.disable_command_h&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyToKey__ KeyCode::H, VK_COMMAND | ModifierFlag::NONE, KeyCode::VK_NONE&lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_SHELL_switchprofile_space&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"shell"</span>&gt;
           <span style="color: #ffa500;">&lt;![</span><span style="color: #b0c4de;">CDATA</span><span style="color: #ffa500;">[</span><span style="color: #ffa500;">    /Applications/Karabiner.app/Contents/Library/bin/karabiner select_by_name space </span><span style="color: #ffa500;">]]&gt;</span>
         &lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_SHELL_switchprofile_nospace&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"shell"</span>&gt;
           <span style="color: #ffa500;">&lt;![</span><span style="color: #b0c4de;">CDATA</span><span style="color: #ffa500;">[</span><span style="color: #ffa500;">    /Applications/Karabiner.app/Contents/Library/bin/karabiner select_by_name nospace </span><span style="color: #ffa500;">]]&gt;</span>
         &lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Switch Profile to space with lcommand + rcommand + 1&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.switchspace&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::1, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_SHELL_switchprofile_space
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Switch Profile to nospace with lcommand + rcommand + 2&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.switchnospace&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::2, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_SHELL_switchprofile_nospace
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">generic URL </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_WEB_karabiner&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span>&gt;https://pqrs.org/osx/karabiner/&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">shell commands </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_SHELL_date_pbcopy&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"shell"</span>&gt;
           <span style="color: #ffa500;">&lt;![</span><span style="color: #b0c4de;">CDATA</span><span style="color: #ffa500;">[</span><span style="color: #ffa500;">    /bin/date | /usr/bin/pbcopy    </span><span style="color: #ffa500;">]]&gt;</span>
         &lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Firefox&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Firefox.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Postman&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Postman.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Finder&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Pycharm&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/PyCharm CE.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Dash&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Dash.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_DoubleCommander&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Double Commander.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Foxmail&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Foxmail.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Newton&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Newton.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Ibook&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/iBooks.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Excel&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Microsoft Excel.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Xmind&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/XMind.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Thunder&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Thunder.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Terminal&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Utilities/Terminal.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_QQ&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/QQ.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Safari&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Safari.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Skim&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Skim.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">for remote terminal </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshcontroller&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/controller.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshobject1&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/object1.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshobject2&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/object2.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshb&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/b.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshop1&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/op1.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshop2&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/op2.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshop3&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/op3.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshop4&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/op4.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshpt&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/pt.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sshup&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/bin/ssh/up.command&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Qianniu&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/AliWorkBench.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Wireshark&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Wireshark.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Map&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Maps.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Ouludict&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Eudb_en_free.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_WangyiMusic&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/NeteaseMusic.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Sublime&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Sublime Text.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Calendar&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Calendar.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_BeyondCompare&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Beyond Compare.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Preview&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Preview.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Numbers&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Numbers.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_VirtualBox&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/VirtualBox.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_karabiner&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Karabiner.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Maps&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Maps.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_FaceTime&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/FaceTime.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">file path </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Calculator&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Calculator.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">file path </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Emacs25mac&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Emacs.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">file path </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Opera&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Opera.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">file path </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_iTerm2&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/iTerm.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">file path </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_weChat&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/WeChat.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">file path </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_APP_Chrome&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Applications/Google Chrome.app&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + w to open https://pqrs.org/osx/karabiner/&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_command_w&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::W, ModifierFlag::COMMAND_R,
           KeyCode::VK_OPEN_URL_WEB_karabiner,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">&lt;item&gt; </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!--   </span><span style="color: #cd5c5c;">&lt;name&gt;Change right-command +left-command + c to launch calculator&lt;/name&gt; </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!--   </span><span style="color: #cd5c5c;">&lt;identifier&gt;private.right_left_command_c&lt;/identifier&gt; </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!--   </span><span style="color: #cd5c5c;">&lt;autogen&gt; </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!--     </span><span style="color: #cd5c5c;">__KeyToKey__ </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!--     </span><span style="color: #cd5c5c;">KeyCode::C, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L, </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!--     </span><span style="color: #cd5c5c;">KeyCode::VK_OPEN_URL_APP_Calculator, </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!--   </span><span style="color: #cd5c5c;">&lt;/autogen&gt; </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">&lt;/item&gt; </span><span style="color: #cd5c5c;">--&gt;</span>

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + m to launch Foxmail&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_m&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::M, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Newton,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + l to launch virtualbox&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_l&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::L, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_VirtualBox,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + v to launch virtualbox&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_v&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::V, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_VirtualBox,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">&lt;name&gt;Change right-command +left-command + f to launch DoubleCommander&lt;/name&gt; </span><span style="color: #cd5c5c;">--&gt;</span>
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + f to launch Finder&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_f&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::F, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Finder,
           <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">KeyCode::VK_OPEN_URL_APP_DoubleCommander, </span><span style="color: #cd5c5c;">--&gt;</span>
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + x to launch Xmind&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_x&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::X, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Xmind,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + s to launch Firefox&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_s&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::S, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Firefox,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + RETURN to launch iTerm2 and Emacs&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_return&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::RETURN, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
           KeyCode::VK_OPEN_URL_APP_Emacs25mac,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + DELETE to launch iTerm2 and Chrome&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_delete&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::DELETE, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
           KeyCode::VK_OPEN_URL_APP_Chrome,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command +left-command + k to launch karabiner&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_k&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::K, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_karabiner,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + left-command + e to launch Emacs&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_e&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::E, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Emacs25mac,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + left-command + j to launch iTerm2 and Emacs&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_j&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::J, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
           KeyCode::VK_OPEN_URL_APP_Emacs25mac,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + left-command + r to launch wireshark&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_r&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::R, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Wireshark,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + left-command + c to launch iTerm2 and Chrome&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_c&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::C, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
           KeyCode::VK_OPEN_URL_APP_Chrome,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + left-command + w to launch weChat&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_w&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::W, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_weChat,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + left-command + i to launch iTerm2&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_i&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::I, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_iTerm2,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;
       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + left-command + g to launch Chrome&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_left_command_g&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::G, ModifierFlag::COMMAND_R, ModifierFlag::COMMAND_L,
           KeyCode::VK_OPEN_URL_APP_Chrome,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Change right-command + d to execute /bin/date | /usr/bin/pbcopy&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">identifier</span>&gt;private.right_command_d&lt;/<span style="color: #9acd32;">identifier</span>&gt;
         &lt;<span style="color: #9acd32;">autogen</span>&gt;
           __KeyToKey__
           KeyCode::D, ModifierFlag::COMMAND_R,
           KeyCode::VK_OPEN_URL_SHELL_date_pbcopy,
         &lt;/<span style="color: #9acd32;">autogen</span>&gt;
       &lt;/<span style="color: #9acd32;">item</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">for virtualbox </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Pengpengxp's irtualBox&lt;/<span style="color: #9acd32;">name</span>&gt;

         &lt;<span style="color: #9acd32;">item</span>&gt;
           &lt;<span style="color: #9acd32;">name</span>&gt;Change Command_L to Control_L&lt;/<span style="color: #9acd32;">name</span>&gt;
           &lt;<span style="color: #9acd32;">identifier</span>&gt;remap.app_vm_commandL2controlL&lt;/<span style="color: #9acd32;">identifier</span>&gt;
           &lt;<span style="color: #9acd32;">only</span>&gt;VIRTUALMACHINE&lt;/<span style="color: #9acd32;">only</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyToKey__ KeyCode::COMMAND_L, KeyCode::CONTROL_L&lt;/<span style="color: #9acd32;">autogen</span>&gt;
         &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;/<span style="color: #9acd32;">item</span>&gt;

       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">use launch mode v2 to switch app </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">for finder </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_FILE_Src&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/src&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_FILE_Tmp&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/tmp&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_FILE_Documents&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/Documents&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;
       &lt;<span style="color: #9acd32;">vkopenurldef</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;KeyCode::VK_OPEN_URL_FILE_Downloads&lt;/<span style="color: #9acd32;">name</span>&gt;
         &lt;<span style="color: #9acd32;">url</span> <span style="color: #8fbc8f;">type</span>=<span style="color: #ffa500;">"file"</span>&gt;/Users/pengpengxp/Downloads&lt;/<span style="color: #9acd32;">url</span>&gt;
       &lt;/<span style="color: #9acd32;">vkopenurldef</span>&gt;

     <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">use launch mode v2 to switch app </span><span style="color: #cd5c5c;">--&gt;</span>
       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">switch prefixkeys </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">replacementdef</span>&gt;
         &lt;<span style="color: #9acd32;">replacementname</span>&gt;LAUNCHER_MODE_V2_KEY&lt;/<span style="color: #9acd32;">replacementname</span>&gt;
         &lt;<span style="color: #9acd32;">replacementvalue</span>&gt;KeyCode::SPACE&lt;/<span style="color: #9acd32;">replacementvalue</span>&gt;
         <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">&lt;replacementvalue&gt;KeyCode::F19&lt;/replacementvalue&gt; </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;/<span style="color: #9acd32;">replacementdef</span>&gt;

       &lt;<span style="color: #9acd32;">replacementdef</span>&gt;

         &lt;<span style="color: #9acd32;">replacementname</span>&gt;LAUNCHER_MODE_V2_EXTRA&lt;/<span style="color: #9acd32;">replacementname</span>&gt;
         &lt;<span style="color: #9acd32;">replacementvalue</span>&gt;
           <span style="color: #ffa500;">&lt;![</span><span style="color: #b0c4de;">CDATA</span><span style="color: #ffa500;">[</span>
<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::E,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Emacs25mac,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::P,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Postman,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::RETURN,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_iTerm2,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Emacs25mac,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::DELETE,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_iTerm2,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Chrome,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::I,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_iTerm2,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::G,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Chrome,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::V,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_VirtualBox,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::K,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_karabiner,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::U,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Excel,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::W,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_weChat,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::N,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Excel,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::B,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_BeyondCompare,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::C,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_iTerm2,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Chrome,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::L,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_VirtualBox,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::J,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_iTerm2,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Emacs25mac,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::X,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Xmind,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::R,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Wireshark,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::M,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Newton,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::F1,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_WangyiMusic,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::F2,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Map,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::F3,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Ouludict,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::S,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Opera,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::D,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Safari,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>
<span style="color: #ffa500;">     &lt;!-- O for open external program --&gt;</span>
<span style="color: #ffa500;">           &lt;autogen&gt;</span>
<span style="color: #ffa500;">             __KeyToKey__</span>
<span style="color: #ffa500;">             KeyCode::O,</span>
<span style="color: #ffa500;">             KeyCode::VK_NONE,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::W,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_WangyiMusic,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::N,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Qianniu,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::O,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Ouludict,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::M,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Map,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::C,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Calendar,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::Q,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_QQ,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::X,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Thunder,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::J,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Calculator,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::K,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Skim,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::I,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Ibook,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::D,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Dash,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::P,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Pycharm,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">           &lt;/autogen&gt;</span>

<span style="color: #ffa500;">     &lt;!-- H for terminal --&gt;</span>
<span style="color: #ffa500;">           &lt;autogen&gt;</span>
<span style="color: #ffa500;">             __KeyToKey__</span>
<span style="color: #ffa500;">             KeyCode::H,</span>
<span style="color: #ffa500;">             KeyCode::VK_NONE,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Terminal,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::T,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Sshpt,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::U,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Sshup,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::O,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Sshop1,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>
<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::1,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Sshop1,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::2,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Sshop2,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::3,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Sshop3,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::4,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Sshop4,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::B,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Sshb,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>
<span style="color: #ffa500;">           &lt;/autogen&gt;</span>

<span style="color: #ffa500;">     &lt;!-- numbers for openstack remote terminal --&gt;</span>
<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::1,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Sshop1,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>
<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::2,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Sshop2,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>
<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::3,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Sshop3,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::4,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Sshcontroller,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::5,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Sshobject1,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">               __KeyDownUpToKey__</span>
<span style="color: #ffa500;">               KeyCode::6,</span>
<span style="color: #ffa500;">               KeyCode::VK_OPEN_URL_APP_Sshobject2,</span>
<span style="color: #ffa500;">             &lt;/autogen&gt;</span>

<span style="color: #ffa500;">     &lt;!-- F for finder --&gt;</span>
<span style="color: #ffa500;">             &lt;autogen&gt;</span>
<span style="color: #ffa500;">             __KeyToKey__</span>
<span style="color: #ffa500;">             KeyCode::F,</span>
<span style="color: #ffa500;">             KeyCode::VK_NONE,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION,</span>
<span style="color: #ffa500;">             &lt;!-- KeyCode::VK_OPEN_URL_APP_Finder, --&gt;</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_APP_Finder,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::D,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_FILE_Desktop,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::F,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_FILE_Home,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::S,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_FILE_Src,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::T,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_FILE_Tmp,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::W,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_FILE_Downloads,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">             Option::KEYTOKEY_DELAYED_ACTION_CANCELED_BY, KeyCode::C,</span>
<span style="color: #ffa500;">             KeyCode::VK_OPEN_URL_FILE_Documents,</span>
<span style="color: #ffa500;">             KeyCode::VK_KEYTOKEY_DELAYED_ACTION_DROP_EVENT,</span>

<span style="color: #ffa500;">           &lt;/autogen&gt;</span>
<span style="color: #ffa500;">           </span><span style="color: #ffa500;">]]&gt;</span>
         &lt;/<span style="color: #9acd32;">replacementvalue</span>&gt;

       &lt;/<span style="color: #9acd32;">replacementdef</span>&gt;

     &lt;/<span style="color: #9acd32;">root</span>&gt;
</pre>
</div>

<p>
在virtualbox等虚拟中修改按键，下面这个可以把左command改为左control：
</p>
<div class="org-src-container">
<pre class="src src-xml">
       <span style="color: #cd5c5c;">&lt;!-- </span><span style="color: #cd5c5c;">for virtualbox </span><span style="color: #cd5c5c;">--&gt;</span>
       &lt;<span style="color: #9acd32;">item</span>&gt;
         &lt;<span style="color: #9acd32;">name</span>&gt;Pengpengxp's irtualBox&lt;/<span style="color: #9acd32;">name</span>&gt;

         &lt;<span style="color: #9acd32;">item</span>&gt;
           &lt;<span style="color: #9acd32;">name</span>&gt;Change Command_L to Control_L&lt;/<span style="color: #9acd32;">name</span>&gt;
           &lt;<span style="color: #9acd32;">identifier</span>&gt;remap.app_vm_commandL2controlL&lt;/<span style="color: #9acd32;">identifier</span>&gt;
           &lt;<span style="color: #9acd32;">only</span>&gt;VIRTUALMACHINE&lt;/<span style="color: #9acd32;">only</span>&gt;
           &lt;<span style="color: #9acd32;">autogen</span>&gt;__KeyToKey__ KeyCode::COMMAND_L, KeyCode::CONTROL_L&lt;/<span style="color: #9acd32;">autogen</span>&gt;
         &lt;/<span style="color: #9acd32;">item</span>&gt;

       &lt;/<span style="color: #9acd32;">item</span>&gt;
</pre>
</div>
</div>
</div>
