wiki/Mac-wiki.html

<div id="outline-container-org02dd53a" class="outline-3">
<h3 id="org02dd53a"><span class="section-number-3">3.6</span> slate <a href="http://www.jianshu.com/p/AyoRZC">中文指导</a></h3>
<div class="outline-text-3" id="text-3-6">
<p>
保存配置好的 <code>~/.slate</code> 文件：
</p>
<div class="org-src-container">
<pre class="src src-js">     # quakex &#30340; slate &#37197;&#32622;&#25991;&#20214;

     # Global Configs &#20840;&#23616;&#37197;&#32622;
     config defaultToCurrentScreen <span style="color: #7fffd4;">true</span>
     # show icons &amp; letters on all windows w/ Window Hints
     config windowHintsShowIcons <span style="color: #7fffd4;">true</span>
     config windowHintsIgnoreHiddenWindows <span style="color: #7fffd4;">false</span>
     config windowHintsSpread <span style="color: #7fffd4;">true</span>

     # General aliases
     alias hyper cmd;ctrl            # &#32452;&#21512;&#38190;
     alias sox screenOriginX
     alias soy screenOriginY
     alias ssx screenSizeX
     alias ssy screenSizeY

     # Show a positioning grid <span style="color: PaleYellow;">for</span> <span style="color: PaleYellow;">each</span> monitor
     bind g:cmd;ctrl grid padding:5 0:2,2 1:2,1       #&#23558;&#31532;&#19968;&#20010;&#31383;&#21475;&#20998;&#25104;4&#20221;&#65292;&#31532;&#20108;&#20998;&#25104;&#20004;&#20221;

     # Monitor Aliases
     alias mon-left 0                # &#22806;&#25509;&#24038;&#36793;&#30340;&#26174;&#31034;&#22120;
     alias mon-macbook 1             # &#31508;&#35760;&#26412;&#23631;&#24149;

     # Abstract positions  &#30456;&#23545;&#20301;&#32622;
     alias centered           ${sox}+${ssx}/8;${soy}+${ssy}/8 ${ssx}/8*6;${ssy}/8*6
     alias fullscreen         ${sox};${soy} ${ssx};${ssy}
     alias leftHalf           ${sox};${soy} ${ssx}/2;${ssy}
     alias bottomHalf         ${sox};${soy}+${ssy}/2 ${ssx};${ssy}/2
     alias topHalf            ${sox};${soy} ${ssx};${ssy}/2
     alias rightHalf          ${sox}+${ssx}/2;${soy} ${ssx}/2;${ssy}
     alias topLeftQuarter     ${sox};${soy} ${ssx}/2;${ssy}/2
     alias topRightQuarter    ${sox}+${ssx}/2;${soy} ${ssx}/2;${ssy}/2
     alias bottomLeftQuarter  ${sox};${soy}+${ssy}/2 ${ssx}/2;${ssy}/2
     alias bottomRightQuarter ${sox}+${ssx}/2;${soy}+${ssy}/2 ${ssx}/2;${ssy}/2
     alias topThird           ${sox};${soy} ${ssx};${ssy}/3
     alias leftThird          ${sox};${soy} ${ssx}/3;${ssy}
     alias bottomThird        ${sox};${soy}+${ssy}/3 ${ssx};${ssy}/3
     alias rightThird         ${sox}+${ssx}/3*2;${soy} ${ssx}/3;${ssy}

     # Concrete positions  &#20855;&#20307;&#20301;&#32622;
     alias 1-full        move ${sox};${soy} ${ssx};${ssy}                ${mon-macbook}
     alias 1-left        move ${sox};${soy} ${ssx}/2;${ssy}              ${mon-macbook}
     alias 1-right       move ${sox}+${ssx}/2;${soy} ${ssx}/2;${ssy}     ${mon-macbook}
     alias 1-rightThird  move ${sox}+${ssx}/3*2;${soy} ${ssx}/3;${ssy}   ${mon-macbook}
     alias 2-left        move ${sox};${soy} ${ssx}/2;${ssy}              ${mon-left}
     alias 2-right       move ${sox}+${ssx}/2;${soy} ${ssx}/2;${ssy}     ${mon-left}
     alias 2-righttop    move ${sox}+${ssx}/2;${soy} ${ssx}/2;${ssy}/2   ${mon-left}
     alias 2-rightbottom move ${sox}+${ssx}/2;${soy}+${ssy}/2 ${ssx}/2;${ssy}/2       ${mon-left}
     alias 2-rightThird  move ${sox}+${ssx}/3*2;${soy} ${ssx}/3;${ssy}   ${mon-left}

     # 2 Monitor layout  &#20004;&#20010;&#26174;&#31034;&#22120;&#26102;&#30340; layout
     layout 2monitors <span style="color: #ffa500;">'iTerm'</span>:REPEAT             ${2-rightbottom} | ${1-left}
     layout 2monitors <span style="color: #ffa500;">'Safari'</span>:REPEAT            ${1-full}
     layout 2monitors <span style="color: #ffa500;">'Sublime Text 2'</span>:REPEAT    ${2-right}
     layout 2monitors <span style="color: #ffa500;">'MacVim'</span>:REPEAT            ${2-left} | ${2-right}
     layout 2monitors <span style="color: #ffa500;">'Mail'</span>:REPEAT              ${2-left}
     layout 2monitors <span style="color: #ffa500;">'Finder'</span>:REPEAT            ${2-righttop}
     layout 2monitors <span style="color: #ffa500;">'Xcode'</span>:REPEAT             ${1-full}
     layout 2monitors <span style="color: #ffa500;">'iTunes'</span>:REPEAT            ${1-full}
     layout 2monitors <span style="color: #ffa500;">'Skim'</span>:REPEAT              ${2-right}
     layout 2monitors <span style="color: #ffa500;">'nvALT'</span>:REPEAT             ${2-rightThird}

     # 1 Monitor layout &#19968;&#20010;&#26174;&#31034;&#22120;&#26102;&#30340;&#24067;&#23616;
     layout 1monitor <span style="color: #ffa500;">'iTerm'</span>:REPEAT              ${1-right}
     layout 1monitor <span style="color: #ffa500;">'Sublime Text 2'</span>:REPEAT     ${1-left}
     layout 1monitor <span style="color: #ffa500;">'MacVim'</span>:REPEAT             ${1-left} | ${1-right}
     layout 1monitor <span style="color: #ffa500;">'Safari'</span>:REPEAT             ${1-full}
     layout 1monitor <span style="color: #ffa500;">'Mail'</span>:REPEAT               ${1-full}
     layout 1monitor <span style="color: #ffa500;">'Finder'</span>:REPEAT             ${1-full}
     layout 1monitor <span style="color: #ffa500;">'Xcode'</span>:REPEAT              ${1-full}
     layout 1monitor <span style="color: #ffa500;">'iTunes'</span>:REPEAT             ${1-full}
     layout 1monitor <span style="color: #ffa500;">'Skim'</span>:REPEAT               ${1-full}
     layout 1monitors <span style="color: #ffa500;">'nvALT'</span>:REPEAT             ${1-rightThird}

     # Default Layouts
     <span style="color: PaleYellow;">default</span> 2monitors resolutions:1680x1050;2560x1600
     <span style="color: PaleYellow;">default</span> 1monitor  resolutions:2560x1600

     bind 1:${hyper} layout 1monitor
     bind 2:${hyper} layout 2monitors

     # Bindings &#27169;&#25311; Vim &#25511;&#21046;&#31383;&#21475;&#20301;&#32622;
     bind g:${hyper} move ${centered}            #ctrl+cmd+g &#23558;&#31383;&#21475;&#23621;&#20013;
     bind o:${hyper} move ${fullscreen}          #ctrl+cmd+o &#20840;&#23631;
     bind h:${hyper} move ${leftHalf}
     bind j:${hyper} move ${bottomHalf}
     bind k:${hyper} move ${topHalf}
     bind l:${hyper} move ${rightHalf}
     bind u:${hyper} move ${topLeftQuarter}
     bind i:${hyper} move ${topRightQuarter}
     bind n:${hyper} move ${bottomLeftQuarter}
     bind m:${hyper} move ${bottomRightQuarter}
     bind y:${hyper} move ${leftThird}
     bind p:${hyper} move ${rightThird}

     # Resize Bindings
     bind right:alt;ctrl       resize +10% +0
     bind left:alt;ctrl        resize -10% +0
     bind up:alt;ctrl          resize +0   -10%
     bind down:alt;ctrl        resize +0   +10%

     # Nudge Bindings
     bind right:shift;alt        nudge +10% +0
     bind left:shift;alt         nudge -10% +0
     bind up:shift;alt           nudge +0   -10%
     bind down:shift;alt         nudge +0   +10%

     # Throw Bindings
     bind [:${hyper} <span style="color: PaleYellow;">throw</span> 0 resize:${ssx};${ssy}
     bind ]:${hyper} <span style="color: PaleYellow;">throw</span> 1 resize:${ssx};${ssy}

     # Window Hints
     bind esc:cmd hint ASDFGQWERTZXCVBN

     # relaunch .slate
     bind s:${hyper} relaunch

     # Focus Bindings
     bind right:${hyper}    focus right
     bind left:${hyper}     focus left
     bind up:${hyper}       focus up
     bind down:${hyper}     focus down

     # undo
     bind z:${hyper} undo

     ## App bindings
     #alias hyperApp alt;ctrl
     #alias editor <span style="color: #ffa500;">'MacVim'</span>
     #alias browser <span style="color: #ffa500;">'Safari'</span>
     #bind e:${hyperApp} focus ${browser}
     #bind v:${hyperApp} focus ${editor}
     #bind x:${hyperApp} focus <span style="color: #ffa500;">'Xcode'</span>
     #bind g:${hyperApp} focus <span style="color: #ffa500;">'GitHub'</span>
     #bind m:${hyperApp} focus <span style="color: #ffa500;">'Mail'</span>
     #bind i:${hyperApp} focus <span style="color: #ffa500;">'iTerm'</span>
     #bind f:${hyperApp} focus <span style="color: #ffa500;">'Finder'</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org8bdbadb" class="outline-3">
<h3 id="org8bdbadb"><span class="section-number-3">3.7</span> catchMouse可以用来在多显示器是切换鼠标焦点</h3>
<div class="outline-text-3" id="text-3-7">
<p>
可以满足当前我的需求。
</p>
</div>
</div>
<div id="outline-container-org18592d8" class="outline-3">
<h3 id="org18592d8"><span class="section-number-3">3.8</span> Spectacle可以实现slate大部分的功能。 <b>最重要的是：它可以把一个windows从一个显示器通过快捷键发送到另一个里面</b></h3>
</div>
<div id="outline-container-org4d00d21" class="outline-3">
<h3 id="org4d00d21"><span class="section-number-3">3.9</span> shortcat 可以使用快捷键来选择</h3>
</div>
</div>
<div id="outline-container-org1db45ac" class="outline-2">
<h2 id="org1db45ac"><span class="section-number-2">4</span> 和原生Terminal打交道</h2>
<div class="outline-text-2" id="text-4">
<p>
默认的Terminal在 <code>/Applications/Utilities/Terminal.app</code> 这里。可以使
用open打开。
</p>

<p>
可以把shell脚本重命名为 <code>XXX.command</code> ，然后使用 <code>open XXX.command</code>
，系统会自动打开一个Terminal并执行对应的脚本。
</p>

<p>
也可以使用 <code>open -b com.apple.terminal /tmp/main.sh</code> 这样的方式来打
开一个Terminal并执行对应的脚本。
</p>
</div>
</div>
