wiki/Mac-wiki.org
* open
  =-a= 选项可以指定打开的应用，：
  #+BEGIN_SRC sh
    open -a /Applications/iTerm.app /tmp/
  #+END_SRC
  不过这样打开的iTerm2是新的标签页，如果需要打开新的窗口呢？

* workspace
  Mac上的workspace简直无语，开了多个desktop，但是`command + tab'还是在
  几十个应用程序里面切换。

  有一些使用技巧在 [[http://apple.stackexchange.com/questions/8191/tricks-and-usages-of-spaces][这里]] 。

  [[https://raamdev.com/2007/replace-os-x-commandtab-with-witch/][这里]] 还有一篇使用wtich。wtich可以大概实现只切换一个desktop中的窗口。
  但是，如果我想把`command + tab'绑定到witch上，需要把原生的绑定先干掉。
  这又需要下载额外的两个软件。麻烦，PASS。
