wiki/Mac-wiki.html
<div id="outline-container-org7561262" class="outline-2">
<h2 id="org7561262"><span class="section-number-2">5</span> open</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>-a</code> 选项可以指定打开的应用，：
</p>
<div class="org-src-container">
<pre class="src src-sh">    open -a /Applications/iTerm.app /tmp/
</pre>
</div>
<p>
不过这样打开的iTerm2是新的标签页，如果需要打开新的窗口呢？
</p>
</div>
</div>

<div id="outline-container-org38a2e65" class="outline-2">
<h2 id="org38a2e65"><span class="section-number-2">6</span> workspace</h2>
<div class="outline-text-2" id="text-6">
<p>
Mac上的workspace简直无语，开了多个desktop，但是`command + tab'还是在
几十个应用程序里面切换。
</p>

<p>
有一些使用技巧在 <a href="http://apple.stackexchange.com/questions/8191/tricks-and-usages-of-spaces">这里</a> 。
</p>

<p>
<a href="https://raamdev.com/2007/replace-os-x-commandtab-with-witch/">这里</a> 还有一篇使用wtich。wtich可以大概实现只切换一个desktop中的窗口。
但是，如果我想把`command + tab'绑定到witch上，需要把原生的绑定先干掉。
这又需要下载额外的两个软件。麻烦，PASS。
</p>
</div>
