wiki/Mac-wiki.org
* 多个远程终端登陆的配置
  常登陆多个机器时，ip不好记。可以修改 =/etc/hosts= 文件，为ip取“名
  字”，比如我的host文件可能长这样：
  #+BEGIN_EXAMPLE
    ##
    # Host Database
    #
    # localhost is used to configure the loopback interface
    # when the system is booting.  Do not change this entry.
    ##
    127.0.0.1       localhost
    255.255.255.255 broadcasthost
    ::1             localhost

    192.168.56.2 pt
    192.168.57.3 up
    192.168.56.111 b
    192.168.56.100 b1
    192.168.56.4 es
    192.168.56.121 do
  #+END_EXAMPLE

  但是有些机器可能ssh端口号不是22,用户名和当前主机登陆的用户名不同。这
  时候可以通过修改 =~/.ssh/config= 来解决。我的可能长这样：
  #+BEGIN_EXAMPLE
    # default
    Host github.com
    HostName github.com
    User git
    IdentityFile ~/.ssh/id_rsa
    # https://github.com/RiverSecurity/Products/wiki/setup_proxy
    # for proxy
    ProxyCommand nc -x 10.16.16.100:1080 %h %p

    # two
    Host pengpengxp.github.com  # 前缀名可以任意设置
    HostName github.com
    User git
    IdentityFile ~/.ssh/id_rsa_pengpengxp

    Host rs250
            Hostname 192.168.2.250
            User antibot
            Port 22

    Host b
            Hostname 192.168.56.111
            User root
            Port 20160

  #+END_EXAMPLE

* archmage
  可以把chm文件弄成http的server，然后我可以使用任何browser来查看。

  安装好后，配合emacs来使用的话，可以直接安装 =chm-view= 。配置很简单：
  #+BEGIN_SRC elisp
    (require 'chm-view)
    (setq chm-view-delay 3)
  #+END_SRC
  然后 =M-x chm-view-file= 就可以啦。

* 修改键盘的速率
  Mac上可以使用下面的命令来修改。使用一次就可以了。不过设置后需要重新
  登陆。参考的 [[https://ksearch.wordpress.com/2017/06/20/increase-the-key-repeat-rate-in-os-x-sierra/][这里]] 。
  #+BEGIN_SRC sh
defaults write -g InitialKeyRepeat -int 10
defaults write -g KeyRepeat -int 1  
  #+END_SRC
