wiki/Mac-wiki.html

<div id="outline-container-orgc532b13" class="outline-2">
<h2 id="orgc532b13"><span class="section-number-2">7</span> 多个远程终端登陆的配置</h2>
<div class="outline-text-2" id="text-7">
<p>
常登陆多个机器时，ip不好记。可以修改 <code>/etc/hosts</code> 文件，为ip取“名
字”，比如我的host文件可能长这样：
</p>
<pre class="example">
    ##
    # Host Database
    #
    # localhost is used to configure the loopback interface
    # when the system is booting.  Do not change this entry.
    ##
    127.0.0.1       localhost
    255.255.255.255 broadcasthost
    ::1             localhost

    192.168.56.2 pt
    192.168.57.3 up
    192.168.56.111 b
    192.168.56.100 b1
    192.168.56.4 es
    192.168.56.121 do
</pre>

<p>
但是有些机器可能ssh端口号不是22,用户名和当前主机登陆的用户名不同。这
时候可以通过修改 <code>~/.ssh/config</code> 来解决。我的可能长这样：
</p>
<pre class="example">
    # default
    Host github.com
    HostName github.com
    User git
    IdentityFile ~/.ssh/id_rsa
    # https://github.com/RiverSecurity/Products/wiki/setup_proxy
    # for proxy
    ProxyCommand nc -x 10.16.16.100:1080 %h %p

    # two
    Host pengpengxp.github.com  # 前缀名可以任意设置
    HostName github.com
    User git
    IdentityFile ~/.ssh/id_rsa_pengpengxp

    Host rs250
            Hostname 192.168.2.250
            User antibot
            Port 22

    Host b
            Hostname 192.168.56.111
            User root
            Port 20160

</pre>
</div>
</div>

<div id="outline-container-org4c50399" class="outline-2">
<h2 id="org4c50399"><span class="section-number-2">8</span> archmage</h2>
<div class="outline-text-2" id="text-8">
<p>
可以把chm文件弄成http的server，然后我可以使用任何browser来查看。
</p>

<p>
安装好后，配合emacs来使用的话，可以直接安装 <code>chm-view</code> 。配置很简单：
</p>
<div class="org-src-container">
<pre class="src src-elisp">    (<span style="color: PaleYellow;">require</span> '<span style="color: #7fffd4;">chm-view</span>)
    (<span style="color: PaleYellow;">setq</span> chm-view-delay 3)
</pre>
</div>
<p>
然后 <code>M-x chm-view-file</code> 就可以啦。
</p>
</div>
</div>

<div id="outline-container-org743aa13" class="outline-2">
<h2 id="org743aa13"><span class="section-number-2">9</span> 修改键盘的速率</h2>
<div class="outline-text-2" id="text-9">
<p>
Mac上可以使用下面的命令来修改。使用一次就可以了。不过设置后需要重新
登陆。参考的 <a href="https://ksearch.wordpress.com/2017/06/20/increase-the-key-repeat-rate-in-os-x-sierra/">这里</a> 。
</p>
<div class="org-src-container">
<pre class="src src-sh">defaults write -g InitialKeyRepeat -int 10
defaults write -g KeyRepeat -int 1  
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pengpengxp</p>
<p class="date">Created: 2019-03-25 一 17:49</p>
<p class="validation"></p>
</div>
</body>
</html>
